[
    {
        "question": "What papers did 'David McSherry' publish in 'Artif. Intell. Rev.' and 'ISAmI'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/63/1255> { ?answer dblp:publishedIn 'Artif. Intell. Rev.' } UNION { ?answer dblp:publishedIn 'ISAmI' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/air/LeakeM05"
            },
            {
                "answer": "https://dblp.org/rec/journals/air/McSherry02"
            },
            {
                "answer": "https://dblp.org/rec/journals/air/McSherry05a"
            },
            {
                "answer": "https://dblp.org/rec/journals/air/McSherry07"
            },
            {
                "answer": "https://dblp.org/rec/journals/air/HassanMB06"
            },
            {
                "answer": "https://dblp.org/rec/journals/air/McSherry05"
            }
        ]
    },
    {
        "question": "What is the primary affiliation of the author named 'Torben Bach Pedersen'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/p/TorbenBachPedersen> dblp:primaryAffiliation ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "Aalborg University, Denmark"
            }
        ]
    },
    {
        "question": "How many publications did 'Ewa Wedrowska' and 'Philipp Hohl' author together?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/324/1323> . ?answer dblp:authoredBy <https://dblp.org/pid/189/6667> }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of the paper 'Wake-up-word spotting using end-to-end deep neural network system' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/icpr/ZhangLQ16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "IBM China Research Lab, Beijing, China",
                "count": "1"
            }
        ]
    },
    {
        "question": "Does the author 'Wen-Hsing Hsu' have a website?",
        "query": "ASK { <https://dblp.org/pid/64/1764> dblp:website ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the DOIs of the publications 'Large-Scale Multi-party Counting Set Intersection Using a Space Efficient Global Synopsis' and 'Study on the Improvement of ELGamal Cryptosystem Based on Elliptic Curve'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/dasfaa/KarapiperisVVC15> dblp:doi ?answer } UNION { <https://dblp.org/rec/journals/jnw/WangS14a> dblp:doi ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "http://dx.doi.org/10.1007/978-3-319-18123-3_20"
            },
            {
                "answer": "https://doi.org/10.1007/978-3-319-18123-3_20"
            },
            {
                "answer": "http://dx.doi.org/10.4304/jnw.9.11.3025-3029"
            },
            {
                "answer": "https://doi.org/10.4304/jnw.9.11.3025-3029"
            }
        ]
    },
    {
        "question": "What are all the papers that the authors 'Zhu Han' and 'Peter B. Henderson' published in 'ICC Workshops'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/83/514> . ?answer dblp:publishedIn 'ICC Workshops' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/07/1965> . ?answer dblp:publishedIn 'ICC Workshops' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/icc/SangareH17"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/DuanMYJH19"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/LiWSH18"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/ChengLSWLLH20"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/MaLRWLH20"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/WangYPSH20"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/ChenWWH0H20"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/SunLCWLLH20"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/SultanSSLH15"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/WeiZYH18"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/YinLLM022"
            },
            {
                "answer": "https://dblp.org/rec/conf/icc/CaoSYH18"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Extracting buildings from aerial topographic maps' also publish a publication in 'IROS'?",
        "query": "ASK { <https://dblp.org/rec/conf/iros/FayekW96> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/iros/FayekW96>) . ?y dblp:publishedIn 'IROS' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Does 'Language-free layout analysis' not not exist?",
        "query": "ASK { <https://dblp.org/rec/conf/icdar/IttnerB93> dblp:title 'Language-free layout analysis' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did 'Kenneth Harttgen' not publish in 'Stat. Comput.' in the last 7 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/141/4822> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-7) . ?x dblp:publishedIn 'Stat. Comput.' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/141/4822> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-7) . ?x dblp:publishedIn 'Stat. Comput.' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many authors of 'Dare to Compare: Motivating Expertise Building in the Enterprise through Intelligent User Modeling Interfaces' have 'Columbia University, New York City, USA' as their primary affiliation?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/cikm/TopkaraWPLL14> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Columbia University, New York City, USA' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "How many authors wrote the paper 'A Simple Integration of Social Relationship and Text Data for Identifying Potential Customers in Microblogging'?",
        "query": "SELECT ?answer WHERE { <https://dblp.org/rec/conf/adma/PangJC13> dblp:numberOfCreators ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "3"
            }
        ]
    },
    {
        "question": "What publications did 'Alain Juarez-Perez' publish in 'Symposium on Computer Animation' and 'J. Econ. Theory'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/156/2724> { ?answer dblp:publishedIn 'Symposium on Computer Animation' } UNION { ?answer dblp:publishedIn 'J. Econ. Theory' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/sca/Juarez-PerezK17"
            }
        ]
    },
    {
        "question": "Did the author 'Fuad Yimer Yesuf' not publish in 'CoRR' in the last 6 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/292/3160> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn 'CoRR' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/292/3160> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn 'CoRR' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What is the average number of publications published by 'Igor A. Bolshakov' per year?",
        "query": "SELECT (AVG(?count) AS ?answer) { SELECT (COUNT(?y) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/98/5681> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "answer": "3.214285714285714"
            }
        ]
    },
    {
        "question": "Which other papers were published by the authors of 'Adaptive Forecast-Based Monitoring for Dynamic Systems'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/technometrics/NembhardK03> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER (?answer != <https://dblp.org/rec/journals/technometrics/NembhardK03>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/chb/BharathiSTN16"
            },
            {
                "answer": "https://dblp.org/rec/journals/eor/NembhardN01"
            },
            {
                "answer": "https://dblp.org/rec/journals/technometrics/Nembhard08"
            },
            {
                "answer": "https://dblp.org/rec/journals/technometrics/Nembhard04"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/Nembhard97"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/NembhardKL99"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/NembhardSA00"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/NembhardSA01"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/NembhardSA02"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/NembhardN96"
            },
            {
                "answer": "https://dblp.org/rec/conf/wsc/RossettiN98"
            },
            {
                "answer": "https://dblp.org/rec/journals/eswa/SwensonBN16"
            },
            {
                "answer": "https://dblp.org/rec/journals/jors/KangNGC18"
            },
            {
                "answer": "https://dblp.org/rec/journals/cbm/TuckerBNLSH15"
            },
            {
                "answer": "https://dblp.org/rec/journals/qre/ChangpetchN08"
            },
            {
                "answer": "https://dblp.org/rec/journals/qre/ChenN11"
            },
            {
                "answer": "https://dblp.org/rec/journals/qre/NembhardC07"
            },
            {
                "answer": "https://dblp.org/rec/journals/qre/NembhardC07a"
            },
            {
                "answer": "https://dblp.org/rec/journals/qre/NembhardV07"
            },
            {
                "answer": "https://dblp.org/rec/journals/qre/Valverde-VenturaN08"
            },
            {
                "answer": "https://dblp.org/rec/journals/itor/MunozNC18"
            }
        ]
    },
    {
        "question": "What are the titles of the publications that 'Wuttipong' published about 'centric networks' published in 'IEICE Trans. Commun.'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Wuttipong', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?answer . FILTER REGEX (?answer, 'centric networks', 'i') . ?z dblp:publishedIn 'IEICE Trans. Commun.' }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "Optimal Cooperative Routing Protocol for Efficient In-Network Cache Management in Content-Centric Networks."
            }
        ]
    },
    {
        "question": "In which conferences or journals did the author 'Andrew Cook' publish papers in the last 6 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/197> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "NIME"
            },
            {
                "answer": "Scholarpedia"
            },
            {
                "answer": "ASE"
            },
            {
                "answer": "EuroS&P Workshops"
            },
            {
                "answer": "DSAA"
            },
            {
                "answer": "Euro-Par Workshops"
            },
            {
                "answer": "Eur. Trans. Telecommun."
            },
            {
                "answer": "Formal Aspects Comput."
            },
            {
                "answer": "J. Autom. Reason."
            },
            {
                "answer": "Interactions"
            },
            {
                "answer": "IEEE Access"
            }
        ]
    },
    {
        "question": "What is the primary affiliation of 'Kai Wang'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/78/2022-14> dblp:primaryAffiliation ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "Tsinghua University, Research Institute of Information Technology, Beijing, China"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Statistically modelling and mining remotely sensed data in urban areas based on topic models - A conceptual analysis' also publish a paper in 'WHISPERS'?",
        "query": "ASK { <https://dblp.org/rec/conf/whispers/LiZL16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/whispers/LiZL16>) . ?y dblp:publishedIn 'WHISPERS' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Did the author 'Zhang Xiong' publish the paper 'Real-Time Anti-Interference Location of Vehicle License Plates Using High-Definition Video' in the last 2 years?",
        "query": "ASK { <https://dblp.org/rec/journals/itsm/ShengLWX09> dblp:authoredBy <https://dblp.org/pid/77/6921-1> . <https://dblp.org/rec/journals/itsm/ShengLWX09> dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-2) }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Does 'Bingtuan Gao' have a website?",
        "query": "ASK { <https://dblp.org/pid/19/7745> dblp:website ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "When was the author 'Scott C. Livingston''s last publication published?",
        "query": "SELECT DISTINCT MAX(xsd:integer(?answer)) AS ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/57/3670> . ?x dblp:yearOfPublication ?answer }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "answer": "2021"
            }
        ]
    },
    {
        "question": "How many different affiliations do the authors of the publication 'Using Formal Concept Analysis to support change analysis' have?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/kbse/SunL11> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "What type of publication is 'Mobile ad hoc networks in the sky: state of the art, opportunities, and challenges'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mobihoc/NamuduriWG13> dblp:bibtexType ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://purl.org/net/nknouf/ns/bibtex#Inproceedings"
            }
        ]
    },
    {
        "question": "What are the venues of the other papers published by the authors of 'Understanding the Seductive Experience'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/cacm/KhaslavskyS99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER (?y != <https://dblp.org/rec/journals/cacm/KhaslavskyS99>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "CHI Conference Summary"
            },
            {
                "answer": "AVI"
            },
            {
                "answer": "Intelligent Environments (Workshops)"
            },
            {
                "answer": "Computer"
            },
            {
                "answer": "Interactions"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Parallel implementation of an extended functional programming language on cellular tree and data flow architectures' not publish 'Iterative Krylov Methods for Acoustic Problems on Graphics Processing Unit'?",
        "query": "ASK { <https://dblp.org/rec/conf/sac/Sanati-MehrizyA92> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-2112-11880> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/corr/abs-2112-11880> != <https://dblp.org/rec/conf/sac/Sanati-MehrizyA92>) FILTER NOT EXISTS { <https://dblp.org/rec/conf/sac/Sanati-MehrizyA92> dblp:authoredBy ?x . <https://dblp.org/rec/journals/corr/abs-2112-11880> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/corr/abs-2112-11880> != <https://dblp.org/rec/conf/sac/Sanati-MehrizyA92>) } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was 'Three-Dimensional Angle of Arrival Estimation in Dynamic Indoor Terahertz Channels Using a Forward-Backward Algorithm' not published in '2017'?",
        "query": "ASK { <https://dblp.org/rec/journals/tvt/PengK17> dblp:yearOfPublication '2017' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tvt/PengK17> dblp:yearOfPublication '2017' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Which paper on '20k electrodes' was published by the author 'Xinyue' in 'BioCAS'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Xinyue', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?answer . FILTER REGEX (?answer, '20k electrodes', 'i') . ?z dblp:publishedIn 'BioCAS' }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "Dual-mode Microelectrode Array Featuring 20k Electrodes and High SNR for Extracellular Recording of Neural Networks."
            }
        ]
    },
    {
        "question": "What is the type of 'A reliable technique for solving third-order dispersion equations'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/kybernetes/Lesnic07> dblp:bibtexType ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://purl.org/net/nknouf/ns/bibtex#Article"
            }
        ]
    },
    {
        "question": "In what venue was 'Representation of Conceptual Dependencies in the Domain Description Code' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/bica/SlieptsovIK19> dblp:publishedIn ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "BICA"
            }
        ]
    },
    {
        "question": "How many papers did the authors of 'NUBSL A Freely Placeable, Low-cost Notification Utility' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/mc/BradeMWG13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "156"
            }
        ]
    },
    {
        "question": "Doesn't the publication 'Computer aided polyp detection in CT colonography using an ensemble of support vector machines' exist?",
        "query": "ASK { <https://dblp.org/rec/conf/cars/JerebkoMFS03> dblp:title 'Computer aided polyp detection in CT colonography using an ensemble of support vector machines' FILTER NOT EXISTS { <https://dblp.org/rec/conf/cars/JerebkoMFS03> dblp:title 'Computer aided polyp detection in CT colonography using an ensemble of support vector machines' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the author 'Riccardo Martoglia' not publish in 'Int. J. Semantic Web Inf. Syst.'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/m/RiccardoMartoglia> . ?x dblp:publishedIn 'Int. J. Semantic Web Inf. Syst.' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/m/RiccardoMartoglia> . ?x dblp:publishedIn 'Int. J. Semantic Web Inf. Syst.' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was the publication 'A novel SVC mechanism for call connection and control in ATM networks' published in the year '1997'?",
        "query": "ASK { <https://dblp.org/rec/journals/comcom/HenryD97> dblp:yearOfPublication '1997' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "In 'Comput. Stand. Interfaces', what papers did the author 'Shangteng Huang' publish?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/6665> . ?answer dblp:publishedIn 'Comput. Stand. Interfaces' }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/csi/HuH07"
            }
        ]
    },
    {
        "question": "Does 'APPLAUS: A Privacy-Preserving Location Proof Updating System for location-based services' exist?",
        "query": "ASK { <https://dblp.org/rec/conf/infocom/ZhuC11> dblp:title 'APPLAUS: A Privacy-Preserving Location Proof Updating System for location-based services' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the papers that the authors 'Slavko Krajcar' and 'B. H. Jajoo' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/61/110> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/87/1393> } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/eurocon/AndrocecK13"
            },
            {
                "answer": "https://dblp.org/rec/conf/eurocon/IlakKRD13"
            },
            {
                "answer": "https://dblp.org/rec/conf/eurocon/KnezovicK13"
            },
            {
                "answer": "https://dblp.org/rec/conf/epia/KrajcarSPB95"
            },
            {
                "answer": "https://dblp.org/rec/conf/isgteurope/LugaricKS10"
            },
            {
                "answer": "https://dblp.org/rec/conf/kes/SkokSK00"
            },
            {
                "answer": "https://dblp.org/rec/conf/iti/LugaricDKR08"
            },
            {
                "answer": "https://dblp.org/rec/conf/iti/RajsiKLDK08"
            },
            {
                "answer": "https://dblp.org/rec/conf/smc/FilipecSK98"
            },
            {
                "answer": "https://dblp.org/rec/journals/eswa/MatijasSK13"
            },
            {
                "answer": "https://dblp.org/rec/conf/ifip/Jajoo94"
            },
            {
                "answer": "https://dblp.org/rec/journals/iam/BhatnagarJ87"
            }
        ]
    },
    {
        "question": "Did the authors 'Qi Li' and 'Olena Orobinska' not co-author the paper 'Fault diagnosis of gearbox using EMD and cepstrum method based on LABVIEW'?",
        "query": "ASK { <https://dblp.org/rec/conf/urai/LiuHLCC16> dblp:authoredBy <https://dblp.org/pid/181/2688> . <https://dblp.org/rec/conf/urai/LiuHLCC16> dblp:authoredBy <https://dblp.org/pid/146/0848> FILTER NOT EXISTS { <https://dblp.org/rec/conf/urai/LiuHLCC16> dblp:authoredBy <https://dblp.org/pid/181/2688> . <https://dblp.org/rec/conf/urai/LiuHLCC16> dblp:authoredBy <https://dblp.org/pid/146/0848> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "From where are most of the authors of 'Incomplete Information Tables and Rough Classification' from?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/ci/StefanowskiT01> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Poznan University of Technology, Poland",
                "count": "1"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'A Call for Change in the Call Center' also publish a paper in 'J. Organ. End User Comput.'?",
        "query": "ASK { <https://dblp.org/rec/journals/joeuc/Richards08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/journals/joeuc/Richards08>) . ?y dblp:publishedIn 'J. Organ. End User Comput.' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "When were 'A Better Lower Bound for On-Line Scheduling' and 'Implicit Incremental Natural Actor Critic' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ipl/BartalKR94> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/iconip/IwakiA17> dblp:yearOfPublication ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "1994"
            },
            {
                "answer": "2017"
            }
        ]
    },
    {
        "question": "In which venues did 'David' publish papers about 'utility maximization'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'David', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?t . FILTER REGEX (?t, 'utility maximization', 'i') . ?z dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "ECCV Workshops (2)"
            },
            {
                "answer": "Games Econ. Behav."
            },
            {
                "answer": "Oper. Res. Lett."
            },
            {
                "answer": "IEEE Commun. Lett."
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Modal Activity-Based Stochastic Model for Estimating Vehicle Trajectories from Sparse Mobile Sensor Data' not publish a paper in 'IEEE Trans. Intell. Transp. Syst.'?",
        "query": "ASK { <https://dblp.org/rec/journals/tits/HaoBWB17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/journals/tits/HaoBWB17>) . ?y dblp:publishedIn 'IEEE Trans. Intell. Transp. Syst.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tits/HaoBWB17> dblp:publishedIn 'IEEE Trans. Intell. Transp. Syst.' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of the paper 'Attribute-Oriented Induction in Relational Databases' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/books/mit/PF91/CaiCH91> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "York University, Toronto, Canada, University of Illinois at Urbana-Champaign, Department of Computer Science, IL, USA",
                "count": "1"
            }
        ]
    }
]