[
    {
        "question": "What are the titles of the papers that the author 'Charmaine Mangram' published and in which venues?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/173/2995> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "Int. J. Serious Games",
                "secondanswer": "Wuzzit Trouble: The Influence of a Digital Math Game on Student Number Sense."
            }
        ]
    },
    {
        "question": "How many papers has the author 'Ayan Roy' published in 'MDM'?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/172/1147> . ?answer dblp:publishedIn 'MDM' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "2"
            }
        ]
    },
    {
        "question": "Did the author 'Chenguang Lu' not publish in 'IEEE Commun. Lett.' in the last 6 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/56/891> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn 'IEEE Commun. Lett.' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/56/891> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn 'IEEE Commun. Lett.' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many authors does the publication 'Including Links in Linked Data: CIDOC-CRM and the Fourth T Berners-Lee Rule' have?",
        "query": "SELECT ?answer WHERE { <https://dblp.org/rec/conf/vast/DAndrea12> dblp:numberOfCreators ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "1"
            }
        ]
    },
    {
        "question": "What are the DOIs of 'Induced packings of cycles' and 'An Energy Efficient Residential Load Management System for Multi-class Appliances in Smart Homes'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/corr/AtminasKR14> dblp:doi ?answer } UNION { <https://dblp.org/rec/conf/nbis/RasheedAJIKCI15> dblp:doi ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "http://dx.doi.org/10.1109/nbis.2015.12"
            },
            {
                "answer": "https://doi.org/10.1109/nbis.2015.12"
            }
        ]
    },
    {
        "question": "Did the author 'Giustino Tonon' publish the paper 'Linking Sap Flow Measurements with Earth Observations' in the last 2 years?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-2108-01290> dblp:authoredBy <https://dblp.org/pid/229/5856> . <https://dblp.org/rec/journals/corr/abs-2108-01290> dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-2) }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "How many authors of 'An Optimal Algorithm for Shortest Paths on Weighted Interval and Circular-Arc Graphs, with Applications' have 'Purdue University, West Lafayette, USA' as their primary affiliation?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/esa/AtallahCL93> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'Purdue University, West Lafayette, USA' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "Did 'Marcus Hutter' not not publish in '2002'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/h/MarcusHutter> . ?x dblp:yearOfPublication '2002' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Did the author 'Yuuta Satomi' not not publish in '2020'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/260/6829> . ?x dblp:yearOfPublication '2020' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of the paper 'Sea surface salinity signatures of tropical instability waves: New evidences from SMOS' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/igarss/YinBRLAM14> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "CNRS/IRD/UPMC/MNHN, Laboratoire d'Oc\u00e9anographie et du Climat-Exp\u00e9rimentation et Approches num\u00e9riques / Institut Pierre Simon Laplace, Paris, France",
                "count": "1"
            }
        ]
    },
    {
        "question": "Was a paper not not co-authored by 'Stanislaw Szufa' and 'Michael W. Mislove'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/223/0147> . ?x dblp:authoredBy <https://dblp.org/pid/m/MWMislove> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Who are the authors of the paper 'GMDH-based dependency modeling in the identification of dynamic systems' and what are their affiliations?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/esm/WaterKW00> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/05/1566",
                "secondanswer": "Delft University of Technology, Netherlands"
            }
        ]
    },
    {
        "question": "Has 'Xiaohu You' not published in 'IEEE Wirel. Commun. Lett.'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/17/1464> . ?x dblp:publishedIn 'IEEE Wirel. Commun. Lett.' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/17/1464> . ?x dblp:publishedIn 'IEEE Wirel. Commun. Lett.' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Didn't the authors of the paper 'Making the Usage of STL Safe'  not publish a paper in 'Generic Programming'?",
        "query": "ASK { <https://dblp.org/rec/conf/ifip2-1/GregorS02> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/ifip2-1/GregorS02>) . ?y dblp:publishedIn 'Generic Programming' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of the paper 'Secure Protocols for Complex Tasks in Complex Environments' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/indocrypt/Sahai04> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "University of California, Los Angeles, USA",
                "count": "1"
            }
        ]
    },
    {
        "question": "Was the paper 'A Functional Approach to Scanner Detection' not co-authored by the authors 'Manaf Gharaibeh' and 'Sijia Wang'?",
        "query": "ASK { <https://dblp.org/rec/conf/aintec/McAndrewGWHP17> dblp:authoredBy <https://dblp.org/pid/155/5769> . <https://dblp.org/rec/conf/aintec/McAndrewGWHP17> dblp:authoredBy <https://dblp.org/pid/30/10352> FILTER NOT EXISTS { <https://dblp.org/rec/conf/aintec/McAndrewGWHP17> dblp:authoredBy <https://dblp.org/pid/155/5769> . <https://dblp.org/rec/conf/aintec/McAndrewGWHP17> dblp:authoredBy <https://dblp.org/pid/30/10352> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was a paper not not co-authored by 'Nesim K. Erkip' and 'Victor W. Pickard'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/06/3738> . ?x dblp:authoredBy <https://dblp.org/pid/50/9277> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What is the average number of co-authors for research papers published by the author 'Eeva Leinonen'?",
        "query": "SELECT (AVG(?count) AS ?answer) { SELECT (COUNT(?y) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/82/4551> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "answer": "1.5"
            }
        ]
    },
    {
        "question": "Did 'Sandeep Sen' not publish in 'IPPS/SPDP'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/s/SandeepSen> . ?x dblp:publishedIn 'IPPS/SPDP' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/s/SandeepSen> . ?x dblp:publishedIn 'IPPS/SPDP' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What is the primary affiliation of 'Zhe Chen'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/06/4240-6> dblp:primaryAffiliation ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "Huawei Technologies, Beijing, China"
            }
        ]
    },
    {
        "question": "What are the papers that 'Jonathan Engelsma' and 'David Rahe' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/82/6127> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/95/996> } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/itng/EngelsmaD11"
            },
            {
                "answer": "https://dblp.org/rec/conf/interspeech/PearceEFJ05"
            },
            {
                "answer": "https://dblp.org/rec/conf/siggraph/ZydaTFEH08"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/EngelsmaF07"
            },
            {
                "answer": "https://dblp.org/rec/conf/lctrts/Engelsma07"
            },
            {
                "answer": "https://dblp.org/rec/conf/IEEEcloud/ShiLLE10"
            },
            {
                "answer": "https://dblp.org/rec/conf/ph/LeeTNKEB09"
            },
            {
                "answer": "https://dblp.org/rec/conf/eit/RestrepoSSTEW12"
            },
            {
                "answer": "https://dblp.org/rec/conf/wimob/EngelsmaFH08"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobicase/EngelsmaJMRVZ12"
            },
            {
                "answer": "https://dblp.org/rec/journals/jnca/ShiLLE11"
            },
            {
                "answer": "https://dblp.org/rec/journals/cga/ZydaTJEFHSKV07"
            },
            {
                "answer": "https://dblp.org/rec/conf/itc/Rahe99"
            }
        ]
    },
    {
        "question": "Did the author 'Zhang Shancong' publish the paper 'Improved Frequency Estimation Algorithm by Least Squares Phase Unwrapping' in 'Circuits Syst. Signal Process.' in the last 3 years?",
        "query": "ASK { <https://dblp.org/rec/journals/cssp/ZhouS18> dblp:authoredBy <https://dblp.org/pid/232/5072> . <https://dblp.org/rec/journals/cssp/ZhouS18> dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-3) . <https://dblp.org/rec/journals/cssp/ZhouS18> dblp:publishedIn 'Circuits Syst. Signal Process.' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'A Blackboard Architecture for Guiding Interactive Proofs' not not publish a paper in 'AIMSA'?",
        "query": "ASK { <https://dblp.org/rec/conf/aimsa/BenzmullerS98> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/aimsa/BenzmullerS98>) . ?y dblp:publishedIn 'AIMSA' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Does the author 'Gerald A. Fisher' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/44/4414> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What papers did 'Shunsuke Yajima' publish in 'IEEE Trans. Ind. Electron.' and 'NSS'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/125/7331> { ?answer dblp:publishedIn 'IEEE Trans. Ind. Electron.' } UNION { ?answer dblp:publishedIn 'NSS' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/tie/YajimaK14"
            }
        ]
    },
    {
        "question": "How many different affiliations do the authors of 'Searching with Uncertainty (Extended Abstract)' have?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/swat/Baeza-YatesCR88> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "Did the author 'Angela Capel' publish in 'CoRR' in the last 9 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/218/6227> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-9) . ?x dblp:publishedIn 'CoRR' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Does the publication 'Joint Frequency Offset and Channel Estimation for MIMO Systems Based on Particle Swarm Optimization' exist?",
        "query": "ASK { <https://dblp.org/rec/conf/vtc/DongLL08> dblp:title 'Joint Frequency Offset and Channel Estimation for MIMO Systems Based on Particle Swarm Optimization' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What papers did 'Jian Lu' publish in 'MobiQuitous' and 'ADBIS Research Communications'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/38/5132> { ?answer dblp:publishedIn 'MobiQuitous' } UNION { ?answer dblp:publishedIn 'ADBIS Research Communications' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/ChenGTL07"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/CuiWGTL16"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/GuW0TL09"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/GuWCLTL10"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/WangGTL17"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/WangGXTLH13"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/XuMCL11"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/YeGTL14"
            },
            {
                "answer": "https://dblp.org/rec/conf/mobiquitous/ZhuW0TL09"
            }
        ]
    },
    {
        "question": "Hasn't 'Volker M\\u00FCller' not published in '1995'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/44/2622> . ?x dblp:yearOfPublication '1995' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Who are the authors of the paper 'Consolidated Product Line Variability Modeling' and the paper 'Efficient Algorithms for Clique-Colouring and Biclique-Colouring Unichord-Free Graphs'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/splc/BayerGHMMOTTW06> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/splc/BayerGHMMOTTW06> dblp:authoredBy ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/pid/65/2215"
            },
            {
                "answer": "https://dblp.org/pid/47/4683"
            },
            {
                "answer": "https://dblp.org/pid/30/2682"
            },
            {
                "answer": "https://dblp.org/pid/83/2380"
            },
            {
                "answer": "https://dblp.org/pid/03/1262"
            },
            {
                "answer": "https://dblp.org/pid/h/OysteinHaugen"
            },
            {
                "answer": "https://dblp.org/pid/70/4436"
            },
            {
                "answer": "https://dblp.org/pid/32/6057"
            },
            {
                "answer": "https://dblp.org/pid/g/SebastienGerard"
            }
        ]
    },
    {
        "question": "How many different affiliations do the authors of the paper 'Drowning in triangle soup: the quest for a better 3-D printing file format' have?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/crossroads/Louis-Rosenberg16> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "In which conferences or journals did the author 'Francisco de Sande' publish papers in the last 3 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/77/3473> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-3) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "HPCC-ICESS"
            },
            {
                "answer": "ISPA"
            },
            {
                "answer": "PARCO"
            },
            {
                "answer": "ISPDC/HeteroPar"
            },
            {
                "answer": "Sci. Program."
            },
            {
                "answer": "PVM/MPI"
            },
            {
                "answer": "PDP"
            },
            {
                "answer": "Euro-Par"
            },
            {
                "answer": "Euro-Par Workshops"
            },
            {
                "answer": "PPAM"
            },
            {
                "answer": "3PGCIC"
            },
            {
                "answer": "PARA"
            },
            {
                "answer": "Real-Time Image and Video Processing"
            },
            {
                "answer": "J. Netw. Comput. Appl."
            },
            {
                "answer": "Concurr. Pract. Exp."
            },
            {
                "answer": "Scalable Comput. Pract. Exp."
            },
            {
                "answer": "Parallel Process. Lett."
            },
            {
                "answer": "Parallel Comput."
            },
            {
                "answer": "Microprocess. Microsystems"
            },
            {
                "answer": "J. Supercomput."
            }
        ]
    },
    {
        "question": "What is the DOI of the publication 'Analysing the behavior of students and lecturers in using social networks for academic and educational purposes'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icrmat/Vu21> dblp:doi ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://dx.doi.org/10.15439/2021km84"
            },
            {
                "answer": "https://doi.org/10.15439/2021km84"
            }
        ]
    },
    {
        "question": "What papers did 'Haijun Yang' publish in 'SMC' and 'OFC/NFOEC'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/68/854> { ?answer dblp:publishedIn 'SMC' } UNION { ?answer dblp:publishedIn 'OFC/NFOEC' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/smc/YangLK03"
            }
        ]
    },
    {
        "question": "What is the ORCID of 'Leonard Barolli'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/09/6391> dblp:orcid ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://orcid.org/0000-0001-9069-0460"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'AAM Toolkit: A System for Visual Object Appearance Modeling' not not publish a paper in 'MISSI'?",
        "query": "ASK { <https://dblp.org/rec/conf/missi/SmiataczS10> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/missi/SmiataczS10>) . ?y dblp:publishedIn 'MISSI' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was a paper not not co-authored by 'Iwao Sasase' and 'Anil Sharma'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/02/3275> . ?x dblp:authoredBy <https://dblp.org/pid/85/2938> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where was the paper 'Training neural network classifiers through Bayes risk minimization applying unidimensional Parzen windows' published and when?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/pr/LazaroHF18> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/journals/pr/LazaroHF18> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "Pattern Recognit.",
                "secondanswer": "2018"
            }
        ]
    },
    {
        "question": "'Ziyao Zheng' published the most papers in which venue and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/271/4293> . ?x dblp:publishedIn ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "CoRR, ISEEIE, VTC Fall",
                "count": "1"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Low-density parity-check codes for space-time wireless transmission' not publish 'Optimizing a Widely Used Protein Structure Alignment Measure in Expected Polynomial Time'?",
        "query": "ASK { <https://dblp.org/rec/journals/twc/LiFK06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tcbb/Poleksic11> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/tcbb/Poleksic11> != <https://dblp.org/rec/journals/twc/LiFK06>) FILTER NOT EXISTS { <https://dblp.org/rec/journals/twc/LiFK06> dblp:authoredBy ?x . <https://dblp.org/rec/journals/tcbb/Poleksic11> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/tcbb/Poleksic11> != <https://dblp.org/rec/journals/twc/LiFK06>) } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What is the DOI of 'A New View of Multi-modal Language Analysis: Audio and Video Features as Text \\'Styles\\''?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eacl/SunSLS21> dblp:doi ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://dx.doi.org/10.18653/v1/2021.eacl-main.167"
            },
            {
                "answer": "https://doi.org/10.18653/v1/2021.eacl-main.167"
            }
        ]
    },
    {
        "question": "How many publications did 'J. Shane Culpepper' and 'Hartry Field' author together?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/03/489> . ?answer dblp:authoredBy <https://dblp.org/pid/72/11326> }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "Which papers did the author 'Saeideh Fallah-Fini' publish in the last 9 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/00/10852> . ?answer dblp:yearOfPublication ?y FILTER(?y > YEAR(NOW())-9) }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/eor/Fallah-FiniTGS12"
            }
        ]
    },
    {
        "question": "Was 'Fine-grain CAM-tag cache resizing using miss tags' not not published in '2002'?",
        "query": "ASK { <https://dblp.org/rec/conf/islped/ZhangA02> dblp:yearOfPublication '2002' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Didn't 'Jon Dehn' not publish the paper 'The Use of Ada to Achieve Fault Tolerance in AAS'?",
        "query": "ASK { <https://dblp.org/rec/conf/sigada/CramerD92> dblp:authoredBy <https://dblp.org/pid/20/4877-1> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "What are the affiliations of the authors of 'Perception of Social Intelligence in Robots Performing False-Belief Tasks'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ro-man/SturgeonPBF19> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "University of Nevada, Reno, Robotics Research Laboratory, NV, USA"
            }
        ]
    },
    {
        "question": "In which venues did 'Beno\\u00EEt Eynard' publish papers in the last 5 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/02/5128> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-5) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "IFIP CAI"
            },
            {
                "answer": "FSKD (4)"
            },
            {
                "answer": "ISPE CE"
            },
            {
                "answer": "CSDM"
            },
            {
                "answer": "PLM"
            },
            {
                "answer": "PLM (2)"
            },
            {
                "answer": "Int. J. Prod. Res."
            },
            {
                "answer": "KMIS"
            },
            {
                "answer": "AI4KM@IJCAI"
            },
            {
                "answer": "ICAILP"
            },
            {
                "answer": "Integr. Comput. Aided Eng."
            },
            {
                "answer": "Document Num\u00e9rique"
            },
            {
                "answer": "Comput. Ind."
            },
            {
                "answer": "Int. J. Manuf. Technol. Manag."
            },
            {
                "answer": "Math. Comput. Simul."
            },
            {
                "answer": "Int. J. Manuf. Res."
            },
            {
                "answer": "Int. J. Hum. Comput. Stud."
            },
            {
                "answer": "Int. J. Inf. Technol. Manag."
            },
            {
                "answer": "Comput. Ind. Eng."
            },
            {
                "answer": "APMS (1)"
            },
            {
                "answer": "APMS"
            },
            {
                "answer": "APMS (3)"
            },
            {
                "answer": "APMS (2)"
            },
            {
                "answer": "AICCSA"
            },
            {
                "answer": "J. Biomed. Informatics"
            },
            {
                "answer": "Robotics Comput. Integr. Manuf."
            },
            {
                "answer": "Int. J. Knowl. Based Organ."
            },
            {
                "answer": "Int. J. Comput. Integr. Manuf."
            },
            {
                "answer": "Frontiers ICT"
            },
            {
                "answer": "Adv. Eng. Informatics"
            },
            {
                "answer": "Int. J. Comput. Appl. Technol."
            },
            {
                "answer": "Concurr. Eng. Res. Appl."
            },
            {
                "answer": "Artif. Intell. Eng. Des. Anal. Manuf."
            },
            {
                "answer": "J. Comput. Inf. Sci. Eng."
            },
            {
                "answer": "Comput. Aided Des."
            }
        ]
    }
]