[
    {
        "question": "Have the authors of the paper 'Vademecum-based approach to multi-scale topological material design' not published a publication in 'Adv. Model. Simul. Eng. Sci.'?",
        "query": "ASK { <https://dblp.org/rec/journals/amses/Ferrer0CL16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/journals/amses/Ferrer0CL16>) . ?y dblp:publishedIn 'Adv. Model. Simul. Eng. Sci.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/amses/Ferrer0CL16> dblp:publishedIn 'Adv. Model. Simul. Eng. Sci.' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "With which author does 'Florian Sikora' has the most research papers with?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/32/6121> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/32/6121>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/131/6607",
                "count": "23"
            }
        ]
    },
    {
        "question": "In which year did 'Larry Scott' publish the least papers and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/49/5871> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "1991",
                "count": "1"
            }
        ]
    },
    {
        "question": "Did the authors '\\u00D6mer Nezih Gerek' and 'Hongqing Sun' not not co-author a paper?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/48/4641> . ?x dblp:authoredBy <https://dblp.org/pid/147/6571> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Has 'S\\u00E9bastien Marcel' not published in 'ACM Multimedia'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/31/5046> . ?x dblp:publishedIn 'ACM Multimedia' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/31/5046> . ?x dblp:publishedIn 'ACM Multimedia' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where was 'A Data-Driven Model Based on Support Vector Machine to Identify Chronic Hypertensive and Diabetic Patients' published and when?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/phycs/Soguero-RuizMM18> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/conf/phycs/Soguero-RuizMM18> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "PhyCS (Selected Papers)",
                "secondanswer": "2019"
            }
        ]
    },
    {
        "question": "Has the paper 'Experio: a Design for Novel Audience Participation in Club Settings' not not been published by 'Bastiaan van Hout'?",
        "query": "ASK { <https://dblp.org/rec/conf/nime/HoutGHFF14> dblp:authoredBy <https://dblp.org/pid/159/7382> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "What are all the papers that the authors 'Nicolaie Lungu' and 'Andrea Saltelli' published in 'Symmetry'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/271/3883> . ?answer dblp:publishedIn 'Symmetry' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/31/6202> . ?answer dblp:publishedIn 'Symmetry' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/symmetry/MarianCL20"
            },
            {
                "answer": "https://dblp.org/rec/journals/symmetry/MarianCL20a"
            },
            {
                "answer": "https://dblp.org/rec/journals/symmetry/MarianCL21"
            }
        ]
    },
    {
        "question": "Did the authors 'Volker Thoma' and 'Huajian Liu' not co-author the paper 'Object representations in ventral and dorsal visual streams: fMRI repetition effects depend on attention and part-whole configuration'?",
        "query": "ASK { <https://dblp.org/rec/journals/neuroimage/ThomaH11> dblp:authoredBy <https://dblp.org/pid/52/4284> . <https://dblp.org/rec/journals/neuroimage/ThomaH11> dblp:authoredBy <https://dblp.org/pid/63/568> FILTER NOT EXISTS { <https://dblp.org/rec/journals/neuroimage/ThomaH11> dblp:authoredBy <https://dblp.org/pid/52/4284> . <https://dblp.org/rec/journals/neuroimage/ThomaH11> dblp:authoredBy <https://dblp.org/pid/63/568> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "When was the author 'Md. Mustafizur Rahman''s first publication published?",
        "query": "SELECT DISTINCT MIN(xsd:integer(?answer)) AS ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/79/3669> . ?x dblp:yearOfPublication ?answer }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "answer": "2007"
            }
        ]
    },
    {
        "question": "What is the primary affiliation of the author 'Ka Lok Man'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/m/KaLokMan> dblp:primaryAffiliation ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "University College Cork, Ireland"
            }
        ]
    },
    {
        "question": "With which author does 'Wolfgang Spie\\u00DFl' has the most research papers with?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/11/4134> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/11/4134>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/s/AlbrechtSchmidt1",
                "count": "8"
            }
        ]
    },
    {
        "question": "Who are the co-authors of 'Timothy J. Moroney' and where are they affiliated?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/95/10870> . ?x dblp:authoredBy ?firstanswer FILTER(?firstanswer != <https://dblp.org/pid/95/10870>) . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/51/9258",
                "secondanswer": "Queensland University of Technology, Brisbane, QLD, Australia"
            },
            {
                "firstanswer": "https://dblp.org/pid/64/2207",
                "secondanswer": "University of Wollongong, Wollongong, School of Mathematics and Applied Statistics, NSW, Australia"
            },
            {
                "firstanswer": "https://dblp.org/pid/52/171",
                "secondanswer": "Queensland University of Technology, School of Mathematical Sciences, Brisbane, Australia"
            },
            {
                "firstanswer": "https://dblp.org/pid/00/8020",
                "secondanswer": "Queensland University of Technology, School of Mathematical Sciences, Brisbane, QLD, Australia"
            },
            {
                "firstanswer": "https://dblp.org/pid/10/9659-1",
                "secondanswer": "Queensland University of Technology, School of Mathematical Sciences, Brisbane, QLD, Australia"
            },
            {
                "firstanswer": "https://dblp.org/pid/60/1325",
                "secondanswer": "Queensland University of Technology, School of Mathematical Sciences, Brisbane, QLD, Australia"
            }
        ]
    },
    {
        "question": "When were the publications 'Motion-Assist Arm with a Passive Joint for an Upper Limb' and 'Assertions About Past and Future in Highways: Global Flush Broadcast and Flush-Vector-Time (Erratum)' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/jrm/KozukaUT20> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/ipl/Ahuja96> dblp:yearOfPublication ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "2020"
            },
            {
                "answer": "1996"
            }
        ]
    },
    {
        "question": "Who is the author of 'Terror tracker system: a web portal for terrorism research'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/jcdl/SchumakerCWW05> dblp:authoredBy ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/pid/12/5838"
            },
            {
                "answer": "https://dblp.org/pid/92/11483"
            },
            {
                "answer": "https://dblp.org/pid/c/HsinchunChen"
            },
            {
                "answer": "https://dblp.org/pid/89/1639"
            }
        ]
    },
    {
        "question": "Was not the paper 'On the Time and Space Complexity of ABA Prevention and Detection' not published in '2015'?",
        "query": "ASK { <https://dblp.org/rec/conf/podc/AghazadehW15> dblp:yearOfPublication '2015' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Did 'Jinghua Wang' publish the paper 'Exploiting Spline Models for the Training of Fully Connected Layers in Neural Network'?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-2102-06554> dblp:authoredBy <https://dblp.org/pid/85/6858> }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Did the authors of the paper 'Scientific potential of European fully open access journals' also publish a paper in 'Scientometrics'?",
        "query": "ASK { <https://dblp.org/rec/journals/scientometrics/JokicMM18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/journals/scientometrics/JokicMM18>) . ?y dblp:publishedIn 'Scientometrics' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "What are the affiliations of the authors of the paper 'Quality of service shared cache management in chip multiprocessor architecture'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/taco/GuoSZI10> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "Intel Labs, Hillsboro, OR, USA"
            },
            {
                "answer": "Intel Corporation, Hillsboro, OR, USA"
            }
        ]
    },
    {
        "question": "In which conferences or journals did 'Oz Pirvandy' publish papers in the last 1 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/310/8495> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-1) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "Big Data Cogn. Comput."
            }
        ]
    },
    {
        "question": "Was the publication 'Dual mode service: Learning from integrating an IP multimedia subsystem service into existing live networks' published in 'Bell Labs Tech. J.'?",
        "query": "ASK { <https://dblp.org/rec/journals/bell/TahatASWCC07> dblp:publishedIn 'Bell Labs Tech. J.' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "'Igor Chikalov' published the most papers in which venue and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/130> . ?x dblp:publishedIn ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Fundam. Informaticae",
                "count": "12"
            }
        ]
    },
    {
        "question": "When was 'NeutronStar: Distributed GNN Training with Hybrid Dependency Management' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/sigmod/WangZWCZY22> dblp:yearOfPublication ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "2022"
            }
        ]
    },
    {
        "question": "How many papers did the authors of the paper 'Phoneme Classification in High-Dimensional Linear Feature Domains' publish in the year '2013'?",
        "query": "SELECT DISTINCT (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/corr/AgerCS13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2013' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "12"
            }
        ]
    },
    {
        "question": "What are all the papers that the authors 'Hildrun Kretschmer' and 'Ken-ichi Sato' published in 'Scientometrics'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/k/HKretschmer> . ?answer dblp:publishedIn 'Scientometrics' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/23/6584> . ?answer dblp:publishedIn 'Scientometrics' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/BhattacharyaKM03"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer01"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer04"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer83"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer83a"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer93"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer94"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerA04"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerBK15"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerK13"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerKBK12"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerKK07"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerLK01a"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerM90"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerOG12"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerPS12"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/OzelKK14"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/PudovkinKSG12"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/ChenWSLK21"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/HouKL08"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer85"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer87"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer90"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer92"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer94a"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer97"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/Kretschmer99"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerG13"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerG98"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerLK01"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KretschmerPS12a"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/KundraK99"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/LiangKGB01"
            },
            {
                "answer": "https://dblp.org/rec/journals/scientometrics/ThelwallBK06"
            }
        ]
    },
    {
        "question": "Was the paper 'Integration of a Multilingual Preordering Component into a Commercial SMT Platform' not co-authored by 'Tony O'Dowd' and 'Cosme A. Ochoa'?",
        "query": "ASK { <https://dblp.org/rec/journals/pbml/RammSSOF17> dblp:authoredBy <https://dblp.org/pid/228/8711> . <https://dblp.org/rec/journals/pbml/RammSSOF17> dblp:authoredBy <https://dblp.org/pid/285/5569> FILTER NOT EXISTS { <https://dblp.org/rec/journals/pbml/RammSSOF17> dblp:authoredBy <https://dblp.org/pid/228/8711> . <https://dblp.org/rec/journals/pbml/RammSSOF17> dblp:authoredBy <https://dblp.org/pid/285/5569> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Who authored 'Towards Visual Cyber Security Analytics for the Masses'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/vissym/UlmerSLKK18> dblp:authoredBy ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/pid/224/8664"
            },
            {
                "answer": "https://dblp.org/pid/224/8672"
            },
            {
                "answer": "https://dblp.org/pid/135/6431"
            },
            {
                "answer": "https://dblp.org/pid/19/4077"
            },
            {
                "answer": "https://dblp.org/pid/132/7473"
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of 'Review and Evaluation of Feature Selection Algorithms in Synthetic Problems' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/corr/abs-1101-2320> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Polytechnic University of Catalonia, Barcelona, Spain",
                "count": "1"
            }
        ]
    },
    {
        "question": "What are the venues of the other papers published by the authors of the paper 'Cube-contractions in 3-connected quadrangulations'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/arsmc/Suzuki16> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER (?y != <https://dblp.org/rec/journals/arsmc/Suzuki16>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "ILP"
            },
            {
                "answer": "ILP (Late Breaking Papers)"
            },
            {
                "answer": "AINA (1)"
            },
            {
                "answer": "HRI"
            },
            {
                "answer": "IIAI-AAI"
            },
            {
                "answer": "WIRI"
            },
            {
                "answer": "CPM"
            },
            {
                "answer": "COLT"
            },
            {
                "answer": "Graph Drawing"
            },
            {
                "answer": "ALT"
            },
            {
                "answer": "PAKDD"
            },
            {
                "answer": "CHI"
            },
            {
                "answer": "UIST (Adjunct Volume)"
            },
            {
                "answer": "MVA"
            },
            {
                "answer": "CloudCom"
            },
            {
                "answer": "IWCIA"
            },
            {
                "answer": "NTCIR"
            },
            {
                "answer": "VR"
            },
            {
                "answer": "SCIS&ISIS"
            },
            {
                "answer": "HCI (5)"
            },
            {
                "answer": "Theor. Comput. Sci."
            },
            {
                "answer": "iiWAS"
            },
            {
                "answer": "AINA (2)"
            },
            {
                "answer": "CogSci"
            },
            {
                "answer": "USENIX Annual Technical Conference"
            },
            {
                "answer": "Australian Conference on Artificial Intelligence"
            },
            {
                "answer": "ISM"
            },
            {
                "answer": "AMC"
            },
            {
                "answer": "ACIIDS (1)"
            },
            {
                "answer": "SoCC"
            },
            {
                "answer": "IEEE BigData"
            },
            {
                "answer": "ICAIIC"
            },
            {
                "answer": "NEMS"
            },
            {
                "answer": "HAI"
            },
            {
                "answer": "IROS"
            },
            {
                "answer": "CC"
            },
            {
                "answer": "Int. J. Comput. Intell. Stud."
            },
            {
                "answer": "PRICAI"
            },
            {
                "answer": "ITSC"
            },
            {
                "answer": "NOMS"
            },
            {
                "answer": "Beyond Planar Graphs"
            },
            {
                "answer": "Graphs Comb."
            },
            {
                "answer": "J. Graph Theory"
            },
            {
                "answer": "SIAM J. Discret. Math."
            },
            {
                "answer": "APNOMS"
            },
            {
                "answer": "Multimodal Technol. Interact."
            },
            {
                "answer": "Discret. Math."
            },
            {
                "answer": "Discuss. Math. Graph Theory"
            },
            {
                "answer": "J. Comb. Theory, Ser. B"
            },
            {
                "answer": "Algorithmica"
            },
            {
                "answer": "J. Robotics Mechatronics"
            },
            {
                "answer": "IEICE Trans. Inf. Syst."
            },
            {
                "answer": "IEICE Trans. Fundam. Electron. Commun. Comput. Sci."
            },
            {
                "answer": "NeuroImage"
            },
            {
                "answer": "IEEE Trans. Computers"
            },
            {
                "answer": "Electron. Notes Discret. Math."
            },
            {
                "answer": "Vietnam. J. Comput. Sci."
            },
            {
                "answer": "Ars Comb."
            },
            {
                "answer": "Mach. Learn."
            },
            {
                "answer": "J. Inf. Process."
            }
        ]
    },
    {
        "question": "Does the publication 'Discrete-Valued Neural Communication' exist?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-2107-02367> dblp:title 'Discrete-Valued Neural Communication' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Doesn't the publication 'Domain Specific Languages for Maintaining and Analyzing Changes in Event-Based Architectures' not exist?",
        "query": "ASK { <https://dblp.org/rec/conf/edoc/TragatschnigZ15> dblp:title 'Domain Specific Languages for Maintaining and Analyzing Changes in Event-Based Architectures' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Which papers did 'Qikun Shen' publish in the last 4 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/119/5371> . ?answer dblp:yearOfPublication ?y FILTER(?y > YEAR(NOW())-4) }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/caasafeproc/GongFZSJS19"
            },
            {
                "answer": "https://dblp.org/rec/conf/caasafeproc/LuS21"
            },
            {
                "answer": "https://dblp.org/rec/journals/automatica/JiangS015"
            },
            {
                "answer": "https://dblp.org/rec/journals/automatica/ShenS15"
            },
            {
                "answer": "https://dblp.org/rec/journals/tsmc/ShenS16"
            },
            {
                "answer": "https://dblp.org/rec/journals/tsmc/ZhangXYS17"
            },
            {
                "answer": "https://dblp.org/rec/journals/access/JiaoS20"
            },
            {
                "answer": "https://dblp.org/rec/journals/jifs/GongJS20"
            },
            {
                "answer": "https://dblp.org/rec/journals/tase/0001S15"
            },
            {
                "answer": "https://dblp.org/rec/journals/tfs/ShenJC12"
            },
            {
                "answer": "https://dblp.org/rec/journals/tfs/ShenJC13"
            },
            {
                "answer": "https://dblp.org/rec/journals/tfs/ShenJC14"
            },
            {
                "answer": "https://dblp.org/rec/journals/tfs/ShenJS14"
            },
            {
                "answer": "https://dblp.org/rec/journals/tfs/ShenJSZ14"
            },
            {
                "answer": "https://dblp.org/rec/journals/tfs/ShenSJS21"
            },
            {
                "answer": "https://dblp.org/rec/journals/ijcon/ShenSZZ19"
            },
            {
                "answer": "https://dblp.org/rec/journals/cnsns/ShenZ15"
            },
            {
                "answer": "https://dblp.org/rec/journals/ijon/ZhangLXYS16"
            },
            {
                "answer": "https://dblp.org/rec/journals/tcbb/JiaoSSS21"
            },
            {
                "answer": "https://dblp.org/rec/journals/tcbb/JiaoZSZS18"
            },
            {
                "answer": "https://dblp.org/rec/journals/tnn/ShenSAS21"
            },
            {
                "answer": "https://dblp.org/rec/journals/tnn/ShenSZL14"
            },
            {
                "answer": "https://dblp.org/rec/journals/tnn/ShenSZWS20"
            },
            {
                "answer": "https://dblp.org/rec/journals/ijon/XiaZYS16"
            },
            {
                "answer": "https://dblp.org/rec/journals/cssp/FuSJ20"
            },
            {
                "answer": "https://dblp.org/rec/journals/tcyb/ShenJSL14"
            },
            {
                "answer": "https://dblp.org/rec/journals/tcyb/ShenSS16"
            },
            {
                "answer": "https://dblp.org/rec/journals/access/LuS21"
            },
            {
                "answer": "https://dblp.org/rec/journals/tie/Shen0SZ17"
            },
            {
                "answer": "https://dblp.org/rec/journals/jsce/ShenJC12"
            },
            {
                "answer": "https://dblp.org/rec/journals/access/JiaoS20a"
            },
            {
                "answer": "https://dblp.org/rec/journals/access/ZhengS20"
            }
        ]
    },
    {
        "question": "What is the average number of research papers published by 'Kiley Sobel' per year?",
        "query": "SELECT (AVG(?count) AS ?answer) { SELECT (COUNT(?y) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/129/1973> . ?x dblp:yearOfPublication ?y } GROUP BY ?y }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "answer": "3.571428571428571"
            }
        ]
    },
    {
        "question": "Did the authors of 'Aviezri Fraenkel: A Brief Biography' not not publish 'Editor's Report'?",
        "query": "ASK { <https://dblp.org/rec/journals/combinatorics/Fraenkel01> dblp:authoredBy ?x . <https://dblp.org/rec/journals/technometrics/Kafadar00b> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/technometrics/Kafadar00b> != <https://dblp.org/rec/journals/combinatorics/Fraenkel01>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    }
]