[
    {
        "question": "What are the titles of the papers that 'Laura Moltedo' published and in which venues?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/40/902> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "CISIS",
                "secondanswer": "Adaptive Semantics of Complex Information/Services Networks: A Case Study from Cultural Heritage."
            },
            {
                "firstanswer": "Optimization Techniques",
                "secondanswer": "An Interactive System for Modelling."
            },
            {
                "firstanswer": "Eurographics",
                "secondanswer": "Extending GKS to a Distributed Architecture."
            },
            {
                "firstanswer": "Eurographics (Tutorials)",
                "secondanswer": "Tutorial 5 - Integrated Environments for Cultural HeritageKnowledgeIntegrated Environments for Cultural HeritageKnowledge."
            },
            {
                "firstanswer": "AVI",
                "secondanswer": "Panel natural, cultural & cybercultural interfaces: points of view."
            },
            {
                "firstanswer": "AVI",
                "secondanswer": "Interfacing with C.H.A.A.T. (Cultural Heritage Assisted Analysis Tools)."
            },
            {
                "firstanswer": "Workstations for Experiments",
                "secondanswer": "Scientific Visualization in Supercomputing Environments."
            },
            {
                "firstanswer": "Comput. Graph. Forum",
                "secondanswer": "ANIMA: An Interactive Tool for Scientific Data Animation."
            },
            {
                "firstanswer": "Comput. Graph. Forum",
                "secondanswer": "PHIFI : A PHIGS Interactive System for the Visualization of Scalar and Vector Fields."
            },
            {
                "firstanswer": "Comput. Graph. Forum",
                "secondanswer": "An Implementer's View of CGM in GKS Environment."
            },
            {
                "firstanswer": "Comput. J.",
                "secondanswer": "An Implementation of 7-Bit Character Encoding for Standard Computer Graphics Environments."
            },
            {
                "firstanswer": "Comput. Networks ISDN Syst.",
                "secondanswer": "Virtual reality and Web tools to convey the visual information of ancient monuments."
            },
            {
                "firstanswer": "Signal Process.",
                "secondanswer": "Color image coding combining linear prediction and iterated function systems."
            },
            {
                "firstanswer": "Comput. Graph.",
                "secondanswer": "Visualizations for a numerical simulation of a flame diffusion model."
            },
            {
                "firstanswer": "Comput. Graph.",
                "secondanswer": "An extension of CGI functions for generation and manipulation of raster images."
            },
            {
                "firstanswer": "Comput. Graph.",
                "secondanswer": "Texture mapping for scientific visualization environments."
            },
            {
                "firstanswer": "Comput. Graph.",
                "secondanswer": "An interactive system for experimental data processing."
            }
        ]
    },
    {
        "question": "What are the papers that 'David A. Bennett' and 'Austin Henderson' published in 'Int. J. Geogr. Inf. Sci.'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/97/1670> . ?answer dblp:publishedIn 'Int. J. Geogr. Inf. Sci.' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/h/AuHenderson> . ?answer dblp:publishedIn 'Int. J. Geogr. Inf. Sci.' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/gis/Bennett97"
            },
            {
                "answer": "https://dblp.org/rec/journals/gis/BennettT06"
            },
            {
                "answer": "https://dblp.org/rec/journals/gis/GongTBT13"
            },
            {
                "answer": "https://dblp.org/rec/journals/gis/SenguptaB03"
            },
            {
                "answer": "https://dblp.org/rec/journals/gis/TangWBL11"
            }
        ]
    },
    {
        "question": "Does 'Jaewoo So' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/05/7533> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Who are the authors of the publication 'Adopting Student-Centred Approach to Advanced Database Teaching' and the publication 'Analysis Disease Progression Using Data Visualization'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/bncod/OussenaD07> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/bncod/OussenaD07> dblp:authoredBy ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/pid/47/3453"
            },
            {
                "answer": "https://dblp.org/pid/71/4044"
            }
        ]
    },
    {
        "question": "When were 'Logic Programming with the World-Wide Web' and 'A High-precision Low-voltage Low Dropout Regulator for SoC with Adaptive Biasing' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/ht/LokeD96> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/iscas/ZhanK09> dblp:yearOfPublication ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "1996"
            },
            {
                "answer": "2009"
            }
        ]
    },
    {
        "question": "In which year did 'Peng Li' publish the most publications?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/83/6353-46> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2019",
                "count": "7"
            }
        ]
    },
    {
        "question": "Where was 'An Extended-Counting Incremental Sigma-Delta ADC with Hardware-Reuse Technique' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/jcsc/ZengGYX16> dblp:publishedIn ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "J. Circuits Syst. Comput."
            }
        ]
    },
    {
        "question": "How many publications did the authors of 'Anomaly Detection in Traffic Surveillance Videos with GAN-based Future Frame Prediction' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/mir/NguyenDDT20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "437"
            }
        ]
    },
    {
        "question": "What are the DOIs of 'Advertising Insertion in Sports Webcasts' and 'Chihuahua Jackets, Lego Weapons, and Vintage Bags'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/ieeemm/WanY07> dblp:doi ?answer } UNION { <https://dblp.org/rec/journals/cse/Day10b> dblp:doi ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "http://dx.doi.org/10.1109/mmul.2007.26"
            },
            {
                "answer": "https://doi.org/10.1109/mmul.2007.26"
            },
            {
                "answer": "http://dx.doi.org/10.1109/mcse.2010.83"
            },
            {
                "answer": "https://doi.org/10.1109/mcse.2010.83"
            }
        ]
    },
    {
        "question": "How many publications has 'Anatoli Nachev' published in 'ISDA'?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/43/5166> . ?answer dblp:publishedIn 'ISDA' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "Where are the authors of 'Batch Neural Gas with Deterministic Initialization for Color Quantization' from?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iccvg/CelebiWSZ12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "Loughborough University, UK"
            },
            {
                "answer": "University of Central Arkansas, Conway, AR, USA"
            },
            {
                "answer": "University of Leicester, Department of Informatics, UK"
            }
        ]
    },
    {
        "question": "Who are the authors of 'A New Collaborative Filtering Recommendation Approach Based on Naive Bayesian Method' and where are they from?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/swarm/WangT11b> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/68/6102-2",
                "secondanswer": "Peking University, Key Laboratory of Machine Perception (MOE) / Department of Machine Intelligence, Beijing, China"
            }
        ]
    },
    {
        "question": "What are the venues of the other papers published by the authors of 'All multipliers for repeated monotone nonlinearities'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tac/KulkarniS02a> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER (?y != <https://dblp.org/rec/journals/tac/KulkarniS02a>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "Encyclopedia of Optimization"
            },
            {
                "answer": "ECC"
            },
            {
                "answer": "CDC"
            },
            {
                "answer": "ACC"
            },
            {
                "answer": "Syst. Control. Lett."
            },
            {
                "answer": "Allerton Conference"
            },
            {
                "answer": "Allerton"
            },
            {
                "answer": "CoDIT"
            },
            {
                "answer": "CDC/ECC"
            },
            {
                "answer": "CCA"
            },
            {
                "answer": "ICIIS"
            },
            {
                "answer": "ROCOND"
            },
            {
                "answer": "EMBC"
            },
            {
                "answer": "VTC Fall"
            },
            {
                "answer": "J. Glob. Optim."
            },
            {
                "answer": "Autom."
            },
            {
                "answer": "IEEE Trans. Syst. Man Cybern."
            },
            {
                "answer": "Int. J. Control"
            },
            {
                "answer": "CoRR"
            },
            {
                "answer": "J. Frankl. Inst."
            },
            {
                "answer": "IEEE Trans. Autom. Control."
            },
            {
                "answer": "IEEE Trans. Very Large Scale Integr. Syst."
            },
            {
                "answer": "IEEE Trans. Neural Networks"
            },
            {
                "answer": "Annu. Rev. Control."
            },
            {
                "answer": "BMC Bioinform."
            },
            {
                "answer": "J. Integr. Bioinform."
            }
        ]
    },
    {
        "question": "Was not the paper 'Early Storage Reclamation in a Tracing Garbage Collector' not published in '1999'?",
        "query": "ASK { <https://dblp.org/rec/journals/sigplan/Harris99> dblp:yearOfPublication '1999' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "How many research papers did the authors 'I-Shyan Hwang' and 'Hongqiang Zhai' co-write?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/87/366> . ?answer dblp:authoredBy <https://dblp.org/pid/63/823> }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "Have 'Christof Teuscher' and 'Arthur Lin' co-authored the paper 'A Reconfigurable Hardware Membrane System'?",
        "query": "ASK { <https://dblp.org/rec/conf/membrane/PetreskaT03> dblp:authoredBy <https://dblp.org/pid/t/ChristofTeuscher> . <https://dblp.org/rec/conf/membrane/PetreskaT03> dblp:authoredBy <https://dblp.org/pid/83/2522> }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was the paper 'Overlay of patient-specific anatomical data for advanced navigation in surgery simulation' not co-authored by the authors 'Simon Adler' and 'Xiaolin Cao'?",
        "query": "ASK { <https://dblp.org/rec/conf/iwde/AdlerSMRP10> dblp:authoredBy <https://dblp.org/pid/08/3076> . <https://dblp.org/rec/conf/iwde/AdlerSMRP10> dblp:authoredBy <https://dblp.org/pid/66/2179> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iwde/AdlerSMRP10> dblp:authoredBy <https://dblp.org/pid/08/3076> . <https://dblp.org/rec/conf/iwde/AdlerSMRP10> dblp:authoredBy <https://dblp.org/pid/66/2179> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Does 'Weiqing Min' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/122/2626> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many venues has the author 'Dragan Bosnacki' published in?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/38/2132> . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "38"
            }
        ]
    },
    {
        "question": "Hasn't 'Soheila Ghambari' not published in '2021'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/211/9694> . ?x dblp:yearOfPublication '2021' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Who is the most frequent co-author of 'Bozena Skolud' and how many publications do they have together?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/9684> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/67/9684>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/15/9685",
                "count": "5"
            }
        ]
    },
    {
        "question": "When was the paper 'Parametric Eye Models' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/mmvr/CrouchC07> dblp:yearOfPublication ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "2007"
            }
        ]
    },
    {
        "question": "Who is the most common co-author of 'Gregory King' and how many papers do they have together?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/30/870> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/30/870>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/30/9191",
                "count": "4"
            }
        ]
    },
    {
        "question": "In what year was the paper 'On the Feasibility of Pressure Profile Measurements With Time-Domain Reflectometry' published and in what venue?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tim/ScheuermannH09> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/journals/tim/ScheuermannH09> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "IEEE Trans. Instrum. Meas.",
                "secondanswer": "2009"
            }
        ]
    },
    {
        "question": "What is the primary affiliation of most of the authors of the paper 'Nonlinear maneuvering with gradient optimization'?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/cdc/SkjetneTK02> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "University of California, Santa Barbara, CA, USA, University of California, Santa Barbara, USA",
                "count": "1"
            }
        ]
    },
    {
        "question": "How many papers did the authors of the publication 'Transmit Strategies for Massive Machine-Type Communications based on Mean Field Games' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/iswcs/BertucciVLPDL18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1026"
            }
        ]
    },
    {
        "question": "In which year did 'Yuanhao Cui' publish the most publications?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/180/7390> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2022",
                "count": "11"
            }
        ]
    },
    {
        "question": "Who are the co-authors of 'Brian Armstrong' and where are they affiliated?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/08/2156> . ?x dblp:authoredBy ?firstanswer FILTER(?firstanswer != <https://dblp.org/pid/08/2156>) . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/e/RudolfEigenmann",
                "secondanswer": "Purdue University, West Lafayette, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/77/811",
                "secondanswer": "Stanford University, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/85/5898",
                "secondanswer": "California Institute of Technology, Pasadena, CA, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/k/AndreKushniruk",
                "secondanswer": "University of Victoria, Canada"
            }
        ]
    },
    {
        "question": "What are the title of the papers that 'K.' wrote about 'adjacency matrices' published in 'Discret. Math.'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'K.', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?answer . FILTER REGEX (?answer, 'adjacency matrices', 'i') . ?z dblp:publishedIn 'Discret. Math.' }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "Commutativity of the adjacency matrices of graphs."
            },
            {
                "answer": "Cayley digraphs with normal adjacency matrices."
            },
            {
                "answer": "Bipartite graphs obtained from adjacency matrices of orientations of graphs."
            },
            {
                "answer": "On conjugate adjacency matrices of a graph."
            }
        ]
    },
    {
        "question": "In what venue was 'Benchmarking RFID profitability in complex retail distribution systems' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/electronicmarkets/GoebelG09> dblp:publishedIn ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "Electron. Mark."
            }
        ]
    },
    {
        "question": "Which papers did the author 'Shifu Wu' write?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/235/0085> }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/acssc/WuGAB18"
            },
            {
                "answer": "https://dblp.org/rec/conf/icecsys/WuB20"
            },
            {
                "answer": "https://dblp.org/rec/conf/mwscas/WuB18"
            },
            {
                "answer": "https://dblp.org/rec/conf/asscc/WuSGBA21"
            },
            {
                "answer": "https://dblp.org/rec/journals/tcasII/WuB21"
            },
            {
                "answer": "https://dblp.org/rec/journals/neuroimage/LiLWGYW19"
            }
        ]
    },
    {
        "question": "Which other papers were published by the authors of the paper 'A methodology for identifying flexible design opportunities in large-scale systems'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/se/AllaverdiB20> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER (?answer != <https://dblp.org/rec/journals/se/AllaverdiB20>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/syscon/AllaverdiHL13"
            },
            {
                "answer": "https://dblp.org/rec/journals/se/Browning09"
            },
            {
                "answer": "https://dblp.org/rec/journals/se/Browning18"
            },
            {
                "answer": "https://dblp.org/rec/journals/se/BrowningFN06"
            },
            {
                "answer": "https://dblp.org/rec/journals/se/BrowningH08"
            },
            {
                "answer": "https://dblp.org/rec/journals/se/EngelB08"
            },
            {
                "answer": "https://dblp.org/rec/journals/msom/SosaMB13"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/Browning01"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/Browning14"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/Browning16"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/BrowningDEW02"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/BrowningE02"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/LevardyB09"
            },
            {
                "answer": "https://dblp.org/rec/journals/tem/MeierBYW15"
            },
            {
                "answer": "https://dblp.org/rec/journals/candie/YassineMB17"
            },
            {
                "answer": "https://dblp.org/rec/journals/eor/HeWBJ22"
            },
            {
                "answer": "https://dblp.org/rec/journals/scheduling/BrowningY10"
            },
            {
                "answer": "https://dblp.org/rec/journals/jid/HonourB07"
            },
            {
                "answer": "https://dblp.org/rec/journals/dsj/BrowningY16"
            },
            {
                "answer": "https://dblp.org/rec/journals/dsj/EngelBR17"
            }
        ]
    },
    {
        "question": "Where were the papers 'Driven Cellular Automata, Adaptation and the Binding Problem' and 'A Framework for Data Quality Assessment in Clinical Research Datasets' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/ecal/Sulis95> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/amia/LeeWP17> dblp:publishedIn ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "ECAL"
            },
            {
                "answer": "AMIA"
            }
        ]
    },
    {
        "question": "How many authors wrote the paper 'Mobile App Stores from the User's Perspective'?",
        "query": "SELECT ?answer WHERE { <https://dblp.org/rec/conf/ifip8-6/BaabdullahARSKP19> dblp:numberOfCreators ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "6"
            }
        ]
    },
    {
        "question": "What are the venues of the other papers published by the authors of the publication 'Concurrent Software Testing Method Based on CSP and PAT'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ACISicis/CaoW18> dblp:authoredBy ?x . ?y dblp:authoredBy ?x . ?y dblp:publishedIn ?answer FILTER (?y != <https://dblp.org/rec/conf/ACISicis/CaoW18>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "CSAI"
            },
            {
                "answer": "CSO (2)"
            },
            {
                "answer": "CSO"
            },
            {
                "answer": "NLPKE"
            },
            {
                "answer": "PAKDD Workshops"
            },
            {
                "answer": "ICIS"
            },
            {
                "answer": "ROBIO"
            },
            {
                "answer": "DSA"
            },
            {
                "answer": "SIS"
            },
            {
                "answer": "ICC"
            },
            {
                "answer": "ICCT"
            },
            {
                "answer": "CISP-BMEI"
            },
            {
                "answer": "SNPD"
            },
            {
                "answer": "EMEIT"
            },
            {
                "answer": "IC-AI"
            },
            {
                "answer": "BigMM"
            },
            {
                "answer": "ACIT-CSI"
            },
            {
                "answer": "AHFE (3)"
            },
            {
                "answer": "AHFE (17)"
            },
            {
                "answer": "ISNN (2)"
            },
            {
                "answer": "IHSI"
            },
            {
                "answer": "Ind. Robot"
            },
            {
                "answer": "IET Image Process."
            },
            {
                "answer": "Int. J. Satell. Commun. Netw."
            },
            {
                "answer": "IFSA/NAFIPS"
            },
            {
                "answer": "Comput. Electr. Eng."
            },
            {
                "answer": "Intell. Inf. Manag."
            },
            {
                "answer": "IEEE Trans. Veh. Technol."
            },
            {
                "answer": "CyberC"
            },
            {
                "answer": "PCM (1)"
            },
            {
                "answer": "Appl. Soft Comput."
            },
            {
                "answer": "Inf."
            },
            {
                "answer": "CoRR"
            },
            {
                "answer": "IEEE ICCI"
            },
            {
                "answer": "Math. Comput. Model."
            },
            {
                "answer": "Multim. Tools Appl."
            },
            {
                "answer": "J. Electronic Imaging"
            },
            {
                "answer": "J. Database Manag."
            },
            {
                "answer": "Int. J. Commun. Syst."
            },
            {
                "answer": "IEEE Access"
            },
            {
                "answer": "Int. J. Softw. Innov."
            }
        ]
    },
    {
        "question": "Didn't the authors of the paper 'Guest Editorial software radios' publish a paper in 'IEEE J. Sel. Areas Commun.'?",
        "query": "ASK { <https://dblp.org/rec/journals/jsac/MitolaBLTT99> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/journals/jsac/MitolaBLTT99>) . ?y dblp:publishedIn 'IEEE J. Sel. Areas Commun.' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jsac/MitolaBLTT99> dblp:publishedIn 'IEEE J. Sel. Areas Commun.' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Does 'Quasi-Linear Transformations, Numeration Systems and Fractals' have a DOI?",
        "query": "ASK { <https://dblp.org/rec/conf/dgci/ColT11> dblp:doi ?y }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    }
]