[
    {
        "question": "Does the publication 'An analytical methodology for assessment of smart monitoring impact on future electric power distribution system reliability' not not exist?",
        "query": "ASK { <https://dblp.org/rec/journals/complexity/AhadiGM15> dblp:title 'An analytical methodology for assessment of smart monitoring impact on future electric power distribution system reliability' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the affiliations of the authors of the paper 'Compressing Large Polygonal Models'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/visualization/HoLK01> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "University of California, San Diego, USA"
            }
        ]
    },
    {
        "question": "What are the primary affiliations of the authors of the paper 'Forensic Analysis and Anonymisation of Printed Documents'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/ih/RichterESS18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "TU Dresden, Germany"
            }
        ]
    },
    {
        "question": "Was the paper 'Near-Omniscient Debugging for Java Using Size-Limited Execution Trace' not not published by 'Kazumasa Shimari'?",
        "query": "ASK { <https://dblp.org/rec/conf/icsm/ShimariI0I19> dblp:authoredBy <https://dblp.org/pid/242/2155> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Was the paper 'Open Embedded Control' published in 'Real Time Syst.'?",
        "query": "ASK { <https://dblp.org/rec/journals/rts/NilssonBL98> dblp:publishedIn 'Real Time Syst.' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Didn't the authors of the paper 'An Integration Framework for Liver Cancer Subtype Classification and Survival Prediction Based on Multi-omics Data' publish a paper in 'ICIC (3)'?",
        "query": "ASK { <https://dblp.org/rec/conf/icic/WangYLLRZZ20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/icic/WangYLLRZZ20>) . ?y dblp:publishedIn 'ICIC (3)' FILTER NOT EXISTS { <https://dblp.org/rec/conf/icic/WangYLLRZZ20> dblp:publishedIn 'ICIC (3)' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Doesn't the publication 'Multi-input Cardiac Image Super-Resolution Using Convolutional Neural Networks' not exist?",
        "query": "ASK { <https://dblp.org/rec/conf/miccai/OktayBLGKCMCOR16> dblp:title 'Multi-input Cardiac Image Super-Resolution Using Convolutional Neural Networks' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was the publication 'Higher-Order Model Checking: An Overview' published in 'LICS'?",
        "query": "ASK { <https://dblp.org/rec/conf/lics/Ong15> dblp:publishedIn 'LICS' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "In which venues did the author 'William Graham Hoover' publish papers in the last 9 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/43/6856> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-9) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "ACPC"
            },
            {
                "answer": "Entropy"
            },
            {
                "answer": "Comput. Sci. Eng."
            },
            {
                "answer": "Commun. Nonlinear Sci. Numer. Simul."
            },
            {
                "answer": "Comput. Phys. Commun."
            },
            {
                "answer": "CoRR"
            },
            {
                "answer": "IEEE Computer Graphics and Applications"
            },
            {
                "answer": "Int. J. Bifurc. Chaos"
            }
        ]
    },
    {
        "question": "In which year did the author 'David S. Doermann' publish the most papers?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/88/6921> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2021",
                "count": "29"
            }
        ]
    },
    {
        "question": "Who are the authors of 'Structured Learning for Action Recognition in Videos' and where are they from?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/esticas/LongSP019> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/r/KaushikRoy",
                "secondanswer": "Purdue University, West Lafayette, IN, USA"
            }
        ]
    },
    {
        "question": "Has 'Maxime Pelcat' published in 'ICASSP'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/30/4280> . ?x dblp:publishedIn 'ICASSP' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Was the publication 'Most Effective Lab Exercises' published in '1989'?",
        "query": "ASK { <https://dblp.org/rec/journals/csedu/Struble89> dblp:yearOfPublication '1989' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Wasn't 'Integration of a Security Type System into a Program Logic' published in the year '2007'?",
        "query": "ASK { <https://dblp.org/rec/conf/tgc/HahnlePRW06> dblp:yearOfPublication '2007' FILTER NOT EXISTS { <https://dblp.org/rec/conf/tgc/HahnlePRW06> dblp:yearOfPublication '2007' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the papers that the authors 'Xu-Shen Zhou' and 'Kyle Mitchell' published?What are all the papers that 'Xu-Shen Zhou' and 'Kyle Mitchell' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/33/561> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/253/5562> } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/fskd/DongZ02"
            },
            {
                "answer": "https://dblp.org/rec/journals/apin/DongZ08"
            },
            {
                "answer": "https://dblp.org/rec/series/sci/DongZ05"
            },
            {
                "answer": "https://dblp.org/rec/conf/vr/KasardaSMKB20"
            },
            {
                "answer": "https://dblp.org/rec/journals/data/GururajanME19"
            },
            {
                "answer": "https://dblp.org/rec/journals/synthese/RossiM20"
            }
        ]
    },
    {
        "question": "In which year did 'Sunil K. Sarin' publish the least papers and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/52/6810> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "1988, 1978, 1993, 1989, 1991, 1994",
                "count": "1"
            }
        ]
    },
    {
        "question": "Didn't 'Tyler Finethy' and 'Nam Soo Kim' not co-author a paper?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/163/6266> . ?x dblp:authoredBy <https://dblp.org/pid/22/792> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Disambiguating Polysemous Word Senses Based on Semantic Types and Syntactic Collocations: A Case Study of \\'Zhongguo+N\\'' not not publish 'T-S fuzzy neural network predictive control for burning zone temperature in rotary kiln with improved hierarchical genetic algorithm'?",
        "query": "ASK { <https://dblp.org/rec/conf/clsw/WangW17> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijmic/TianLW16> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/ijmic/TianLW16> != <https://dblp.org/rec/conf/clsw/WangW17>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "In '2013', how many publications has 'Rose F. Gamble' published?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/25/2193> . ?answer dblp:publishedIn '2013' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "Did the author 'Lu\\u00EDs Bernardo' not publish in 'VTC Fall' in the last 4 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/72/3100> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-4) . ?x dblp:publishedIn 'VTC Fall' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/72/3100> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-4) . ?x dblp:publishedIn 'VTC Fall' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "In what year was the paper 'Multi-output Bus Travel Time Prediction with Convolutional LSTM Neural Network' published and in what venue?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/corr/abs-1903-02791> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/journals/corr/abs-1903-02791> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "CoRR",
                "secondanswer": "2019"
            }
        ]
    },
    {
        "question": "'Van Ha Le' published the most publications in which venue?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/317/9144> . ?x dblp:publishedIn ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "ICAAI",
                "count": "1"
            }
        ]
    },
    {
        "question": "How many authors of the paper 'An optimal constant level rationing policy under service level constraints' have 'University of Cologne, Department of Supply Chain Management and Management Science, Germany' as their primary affiliation?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/ors/MolleringT10> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Cologne, Department of Supply Chain Management and Management Science, Germany' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "Who authored 'TDMA-Like Infrared Uplink with Multi-Faces Photodiode Access Points'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icc/BuiB19> dblp:authoredBy ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/pid/202/5458"
            },
            {
                "answer": "https://dblp.org/pid/60/4488"
            }
        ]
    },
    {
        "question": "In which year did the author 'Siva Sivabalan' publish the most research papers?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/209/6022> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2020",
                "count": "4"
            }
        ]
    },
    {
        "question": "Did the authors of 'Modeling of dynamic data-driven approach for the distributed steel rolling heating furnace temperature field' not not publish 'The Effects of Physical Design Characteristics on the Area-Performance Tradeoff Curve'?",
        "query": "ASK { <https://dblp.org/rec/journals/nca/BaoZGXZ22> dblp:authoredBy ?x . <https://dblp.org/rec/conf/dac/ParkerGH91> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/dac/ParkerGH91> != <https://dblp.org/rec/journals/nca/BaoZGXZ22>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the author 'J\\u00FCrgen G\\u00F6tze' publish the paper 'Reducing complexity of generalized minimum mean square error detection' in 'EUSIPCO' in the last 8 years?",
        "query": "ASK { <https://dblp.org/rec/conf/eusipco/MorsyG10> dblp:authoredBy <https://dblp.org/pid/43/6299> . <https://dblp.org/rec/conf/eusipco/MorsyG10> dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-8) . <https://dblp.org/rec/conf/eusipco/MorsyG10> dblp:publishedIn 'EUSIPCO' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "From where are most of the authors of 'An Approach for Resiliency Quantification of Large Scale Systems' from?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/sigmetrics/LongoGNRT17> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Duke University, University of Messina, Italy, IBM Corporation, Center for Advanced Studies, Research Triangle Park, NC, USA, Duke University, Durham, NC, USA",
                "count": "1"
            }
        ]
    },
    {
        "question": "Didn't 'Lawrence J. Fogel' and 'Mei Hong' not co-author a paper?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/78/6587> . ?x dblp:authoredBy <https://dblp.org/pid/90/4422> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Doesn't the publication 'Book Review: R J G B de Queiroz, A G de Oliveira, D M Gabbay, The Functional Interpretation of Logical Deduction' not exist?",
        "query": "ASK { <https://dblp.org/rec/journals/sLogica/Rezus15> dblp:title 'Book Review: R J G B de Queiroz, A G de Oliveira, D M Gabbay, The Functional Interpretation of Logical Deduction' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where are the authors of 'Diagnosis of attention deficit and hyperactivity disorder (ADHD) using Hidden Markov Models' from?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/eusipco/Maya-Piedrahita20> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "Technological University of Pereira, Colombia"
            },
            {
                "answer": "National University of Colombia, Signal Processing and Recognition Group, Manizales"
            }
        ]
    },
    {
        "question": "Was the paper 'On the Order Dimension of Convex Geometries' not not published by 'Jonathan E. Beagley'?",
        "query": "ASK { <https://dblp.org/rec/journals/order/Beagley13> dblp:authoredBy <https://dblp.org/pid/135/5695> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Does 'Neurological Dashboards and Consultation Turnaround Time at an Academic Medical Center' have a DOI?",
        "query": "ASK { <https://dblp.org/rec/journals/aci/KummerWZHSEH19> dblp:doi ?y }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Didn't 'Gerhard Fischer' and 'Lefei Zhang' not co-author a paper?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/f/GerhardFischer> . ?x dblp:authoredBy <https://dblp.org/pid/28/10770> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Doesn't the publication 'Sneak paths effects in CBRAM memristive devices arrays for spiking neural networks' exist?",
        "query": "ASK { <https://dblp.org/rec/conf/nanoarch/RoclinBGK14> dblp:title 'Sneak paths effects in CBRAM memristive devices arrays for spiking neural networks' FILTER NOT EXISTS { <https://dblp.org/rec/conf/nanoarch/RoclinBGK14> dblp:title 'Sneak paths effects in CBRAM memristive devices arrays for spiking neural networks' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of the paper 'Abelian Complexity and Synchronization' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/corr/abs-2011-00453> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "University of Waterloo, School of Computer Science, ON, Canada",
                "count": "1"
            }
        ]
    },
    {
        "question": "Where was 'ContextUML: A UML-Based Modeling Language for Model-Driven Development of Context-Aware Web Services' published and when?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/icmb/ShengB05> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/conf/icmb/ShengB05> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "ICMB",
                "secondanswer": "2005"
            }
        ]
    },
    {
        "question": "How many authors of 'Reliability evaluation of logic circuits using probabilistic gate models' have 'University of Alberta, Department of Electrical and Computer Engineering, Edmonton, AB, Canada' as their primary affiliation?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/mr/HanCBF11> dblp:authoredBy ?answer . ?answer dblp:primaryAffiliation 'University of Alberta, Department of Electrical and Computer Engineering, Edmonton, AB, Canada' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "How many papers has 'Maurizio Schmid' published in '2009'?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/56/5690> . ?answer dblp:publishedIn '2009' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "What are the papers that the authors 'Thomas Serries' and 'Karl Meinke' published in 'Wirtschaftsinformatik'?What are all the papers that 'Thomas Serries' and 'Karl Meinke' published in 'Wirtschaftsinformatik'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/00/56> . ?answer dblp:publishedIn 'Wirtschaftsinformatik' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/70/1381> . ?answer dblp:publishedIn 'Wirtschaftsinformatik' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/wirtschaftsinformatik/NeumannSB01"
            }
        ]
    },
    {
        "question": "Has 'Seiichi Namba' not published in 'IEICE Trans. Fundam. Electron. Commun. Comput. Sci.'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/21/5511> . ?x dblp:publishedIn 'IEICE Trans. Fundam. Electron. Commun. Comput. Sci.' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/21/5511> . ?x dblp:publishedIn 'IEICE Trans. Fundam. Electron. Commun. Comput. Sci.' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was the paper 'Minimum Cost Feedback Selection for Arbitrary Pole Placement in Structured Systems' not co-authored by the authors 'Prasanna Chaporkar' and 'Alejandro Jaimes'?",
        "query": "ASK { <https://dblp.org/rec/journals/tac/MoothedathCB18a> dblp:authoredBy <https://dblp.org/pid/87/4995> . <https://dblp.org/rec/journals/tac/MoothedathCB18a> dblp:authoredBy <https://dblp.org/pid/45/956> FILTER NOT EXISTS { <https://dblp.org/rec/journals/tac/MoothedathCB18a> dblp:authoredBy <https://dblp.org/pid/87/4995> . <https://dblp.org/rec/journals/tac/MoothedathCB18a> dblp:authoredBy <https://dblp.org/pid/45/956> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the venues in which the author 'Victoria Wang' published?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/34/2863> . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "Gov. Inf. Q."
            },
            {
                "answer": "Int. J. Virtual Communities Soc. Netw."
            },
            {
                "answer": "WADT"
            },
            {
                "answer": "ISQED"
            },
            {
                "answer": "ISCAS"
            },
            {
                "answer": "ICCAD"
            },
            {
                "answer": "SMC"
            },
            {
                "answer": "MWSCAS"
            },
            {
                "answer": "ISSCC"
            },
            {
                "answer": "J. Inf. Commun. Ethics Soc."
            },
            {
                "answer": "CoRR"
            },
            {
                "answer": "Inf. Polity"
            },
            {
                "answer": "Entropy"
            },
            {
                "answer": "Telematics Informatics"
            },
            {
                "answer": "J. Cybersecur."
            },
            {
                "answer": "Computer"
            },
            {
                "answer": "Comput. Secur."
            },
            {
                "answer": "IEEE Access"
            }
        ]
    },
    {
        "question": "Where were the publications 'Simulated analysis of connectivity issues for sleeping sensor nodes in the internet of things' and 'Performance analysis of orthogonal frequency division multiplexing-based cooperative amplify-and-forward networks with non-linear power amplifier over independently but not necessarily identically distributed Nakagami-m fading channels' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/pe-wasun/WardMC14> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/iet-com/KumarSB17> dblp:publishedIn ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "PE-WASUN"
            },
            {
                "answer": "IET Commun."
            }
        ]
    },
    {
        "question": "Was the paper 'IT Is Here to Serve' co-authored by 'Todd W. Kolb' and 'Zhijia Yang'?",
        "query": "ASK { <https://dblp.org/rec/journals/itpro/Kolb09> dblp:authoredBy <https://dblp.org/pid/76/4125> . <https://dblp.org/rec/journals/itpro/Kolb09> dblp:authoredBy <https://dblp.org/pid/67/7153> }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the authors of 'Nenya: subtle and eyes-free mobile input with a magnetically-tracked finger ring' not publish 'Discovering Latent Threads in Entity Histories'?",
        "query": "ASK { <https://dblp.org/rec/conf/chi/AshbrookBW11> dblp:authoredBy ?x . <https://dblp.org/rec/journals/dase/DuanJT19> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/dase/DuanJT19> != <https://dblp.org/rec/conf/chi/AshbrookBW11>) FILTER NOT EXISTS { <https://dblp.org/rec/conf/chi/AshbrookBW11> dblp:authoredBy ?x . <https://dblp.org/rec/journals/dase/DuanJT19> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/dase/DuanJT19> != <https://dblp.org/rec/conf/chi/AshbrookBW11>) } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "When was 'On Session Key Construction in Provably-Secure Key Establishment Protocols: Revisiting Chen & Kudla (2003) and McCullagh & Barreto (2005) ID-Based Protocols' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/iacr/ChooBH05> dblp:yearOfPublication ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "2005"
            }
        ]
    },
    {
        "question": "Who is the most frequent co-author of 'Alher Mauricio Hern\\u00E1ndez'?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/18/9504> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/18/9504>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/79/9503",
                "count": "7"
            }
        ]
    },
    {
        "question": "Does the publication 'Data-Derived Modeling Characterizes Plasticity of MAPK Signaling in Melanoma' not not exist?",
        "query": "ASK { <https://dblp.org/rec/journals/ploscb/Bernardo-FauraMFBE14> dblp:title 'Data-Derived Modeling Characterizes Plasticity of MAPK Signaling in Melanoma' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What is the primary affiliation of the author named 'Abbas Jamalipour'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/76/4975> dblp:primaryAffiliation ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "University of Sydney, Australia"
            }
        ]
    },
    {
        "question": "Does 'A novel multilayer neural networks training algorithm that minimizes the probability of classification error' not exist?",
        "query": "ASK { <https://dblp.org/rec/journals/tnn/Nedeljkovic93> dblp:title 'A novel multilayer neural networks training algorithm that minimizes the probability of classification error' FILTER NOT EXISTS { <https://dblp.org/rec/journals/tnn/Nedeljkovic93> dblp:title 'A novel multilayer neural networks training algorithm that minimizes the probability of classification error' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Has the author 'Stefan Schulz' published in 'ExaCt'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/91/3020-4> . ?x dblp:publishedIn 'ExaCt' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    }
]