[
    {
        "question": "Haven't the authors of the publication 'Performance tuning for automotive Software Fault Prediction' not published a publication in 'SANER'?",
        "query": "ASK { <https://dblp.org/rec/conf/wcre/AltingerHSGW17> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/wcre/AltingerHSGW17>) . ?y dblp:publishedIn 'SANER' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Which publications did 'Yong Chen' author?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/67/6351-8> }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/iconip/ZhangZCL17"
            },
            {
                "answer": "https://dblp.org/rec/conf/ictai/WangLCZY19"
            },
            {
                "answer": "https://dblp.org/rec/conf/ictai/ZhangZWLZJC16"
            },
            {
                "answer": "https://dblp.org/rec/conf/sigir/0008HLZLZ21"
            },
            {
                "answer": "https://dblp.org/rec/conf/ijcai/LiuPCZ20"
            },
            {
                "answer": "https://dblp.org/rec/conf/icdm/ChenZWWLL15"
            },
            {
                "answer": "https://dblp.org/rec/conf/bigcomp/LiZC18"
            },
            {
                "answer": "https://dblp.org/rec/conf/dasc/ZhangZLCY17"
            },
            {
                "answer": "https://dblp.org/rec/conf/dai2/ZhouCWYS0ZW19"
            },
            {
                "answer": "https://dblp.org/rec/conf/cse/ChenZZW13"
            },
            {
                "answer": "https://dblp.org/rec/conf/cse/SunZLC17"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-1809-03738"
            },
            {
                "answer": "https://dblp.org/rec/journals/tmm/ChenZZL18"
            },
            {
                "answer": "https://dblp.org/rec/journals/eis/ZhangWWBC14"
            },
            {
                "answer": "https://dblp.org/rec/conf/cscwd/FengZLC18"
            },
            {
                "answer": "https://dblp.org/rec/journals/tip/ChenTZWZ20"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-1911-00179"
            },
            {
                "answer": "https://dblp.org/rec/journals/kbs/ChenZLYL19"
            },
            {
                "answer": "https://dblp.org/rec/journals/ijon/ChenZTL17"
            },
            {
                "answer": "https://dblp.org/rec/journals/ijon/ChenZLY18"
            },
            {
                "answer": "https://dblp.org/rec/journals/pr/TianZCZ20"
            },
            {
                "answer": "https://dblp.org/rec/journals/tkde/ChenWLLZY20"
            },
            {
                "answer": "https://dblp.org/rec/journals/tkde/ChenZTWZL22"
            }
        ]
    },
    {
        "question": "What are the affiliations of the authors of the paper 'Using Building Blocks to Construct Effective Learning Objects'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/pacis/LindenL15> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "University of Melbourne, School of Computing and Information Systems, Australia"
            }
        ]
    },
    {
        "question": "In which year did the author 'Yuan Tian' publish the most papers?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/39/5423-8> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2014",
                "count": "7"
            }
        ]
    },
    {
        "question": "Which papers did 'Tri Mayang Mekar' publish in 'FEMIB'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/320/3739> . ?answer dblp:publishedIn 'FEMIB' }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/femib/NusraningrumMA22"
            }
        ]
    },
    {
        "question": "What are the papers that the authors 'Alfons Juan-C\\u00EDscar' and 'Robert van Liere' published in 'ICPR (1)'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/j/AlfonsJuan> . ?answer dblp:publishedIn 'ICPR (1)' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/38/3928> . ?answer dblp:publishedIn 'ICPR (1)' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/icpr/ToselliJV04"
            }
        ]
    },
    {
        "question": "In what venue was the paper 'Full decodable code-word sets' published and when?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tit/SchutzenbergerM59> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/journals/tit/SchutzenbergerM59> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "IRE Trans. Inf. Theory",
                "secondanswer": "1959"
            }
        ]
    },
    {
        "question": "With how many other authors has 'Yafeng Yin' co-authored papers?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/04/934> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/04/934>) }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "116"
            }
        ]
    },
    {
        "question": "Was the publication 'Review of: Gartner, Richard Metadata: shaping knowledge from antiquity to the semantic web Basel: Springer International Publishing AG, 2016' published in 'Inf. Res.'?",
        "query": "ASK { <https://dblp.org/rec/journals/ires/Wilson17d> dblp:publishedIn 'Inf. Res.' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Does the author 'Omar Alonso' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/a/OmarAlonso> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What is the type of the publication 'A Case Study of Automated Curation of Digital Archives'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dihu/Hanna17> dblp:bibtexType ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://purl.org/net/nknouf/ns/bibtex#Inproceedings"
            }
        ]
    },
    {
        "question": "In which year did 'Alfonso Ba\\u00F1os' publish the most publications?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/37/2257> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2011",
                "count": "7"
            }
        ]
    },
    {
        "question": "What is the average number of co-authors for publications published by 'Ya-Shu Chen'?",
        "query": "SELECT (AVG(?count) AS ?answer) { SELECT (COUNT(?y) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/599> . ?x dblp:numberOfCreators ?y } GROUP BY ?y }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "answer": "8.8"
            }
        ]
    },
    {
        "question": "Who are the authors of the publication 'Active Learning of Strict Partial Orders: A Case Study on Concept Prerequisite Relations' and what are their affiliations?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/edm/LiangYZPG19> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/03/3520-2",
                "secondanswer": "University of Illinois at Urbana-Champaign, Department of Computer Science, IL, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/35/3221-1",
                "secondanswer": "Pennsylvania State University, College of Information Sciences and Technology, University Park, PA, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/g/CLeeGiles",
                "secondanswer": "Penn State, University Park, USA"
            }
        ]
    },
    {
        "question": "In which year did 'Anil Sagar' publish the least papers and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/81/246> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2006, 2015, 2007",
                "count": "1"
            }
        ]
    },
    {
        "question": "In which venues did the author 'Patricia Lutsky' publish papers and what are the titles of these papers?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/34/2741> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "SAC",
                "secondanswer": "Using a document parser to automate software testing."
            },
            {
                "firstanswer": "ACL",
                "secondanswer": "Documentation Parser to Extract Software Test Conditions."
            },
            {
                "firstanswer": "IEA/AIE",
                "secondanswer": "Information Extraction for Validation of Software Documentation."
            },
            {
                "firstanswer": "WCRE",
                "secondanswer": "Automating Testing by Reverse Engineering of Software Documentation."
            },
            {
                "firstanswer": "Artif. Intell. Eng.",
                "secondanswer": "Information extraction from documents for automating software testing."
            }
        ]
    },
    {
        "question": "What is the primary affiliation of most of the authors of the paper 'Boosting Statistical Word Alignment Using Labeled and Unlabeled Data'?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/acl/WuWL06> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Baidu Inc., Beijing, China, Baidu Inc., China",
                "count": "1"
            }
        ]
    },
    {
        "question": "Does the author 'Malak Sarkis' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/191/6828> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many papers has the author 'Brian Coffen' published?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/267/4973> }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "2"
            }
        ]
    },
    {
        "question": "How many publications did the authors of the publication 'Linux Watch: Hardware Platform for Wearable Computing Research' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/pcm/KamijohIKT01> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "23"
            }
        ]
    },
    {
        "question": "How many publications has 'Vasco Brattka' published?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/b/VascoBrattka> }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "108"
            }
        ]
    },
    {
        "question": "'Wenxue' published research papers about 'climate change scenarios' in which venues?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Wenxue', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?t . FILTER REGEX (?t, 'climate change scenarios', 'i') . ?z dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "Remote. Sens."
            }
        ]
    },
    {
        "question": "Didn't the authors of the paper 'Defending TCP Against Spoofing Attacks' publish 'Multimodal Integration A Biological View'?",
        "query": "ASK { <https://dblp.org/rec/journals/rfc/rfc4953> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ijcai/Coen01> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/ijcai/Coen01> != <https://dblp.org/rec/journals/rfc/rfc4953>) FILTER NOT EXISTS { <https://dblp.org/rec/journals/rfc/rfc4953> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ijcai/Coen01> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/ijcai/Coen01> != <https://dblp.org/rec/journals/rfc/rfc4953>) } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the authors 'Juan Gabriel Rodr\\u00EDguez' and 'Ondrej Popelka' not co-author the paper 'The Gini coefficient: Majority voting and social welfare'?",
        "query": "ASK { <https://dblp.org/rec/journals/jet/RodriguezS14> dblp:authoredBy <https://dblp.org/pid/92/11319> . <https://dblp.org/rec/journals/jet/RodriguezS14> dblp:authoredBy <https://dblp.org/pid/91/1659> FILTER NOT EXISTS { <https://dblp.org/rec/journals/jet/RodriguezS14> dblp:authoredBy <https://dblp.org/pid/92/11319> . <https://dblp.org/rec/journals/jet/RodriguezS14> dblp:authoredBy <https://dblp.org/pid/91/1659> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many publications did the authors of the paper 'Slotted Aloha for Networked Base Stations with Spatial and Temporal Diversity' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/corr/JakoveticBVC14> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "275"
            }
        ]
    },
    {
        "question": "With which author does 'Dragan Milic' has the most research papers with?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/53/2368> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/53/2368>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/b/TorstenBraun",
                "count": "10"
            }
        ]
    },
    {
        "question": "Where were the papers 'Identification and Analysis of Email and Contacts Artefacts on iOS and OS X' and 'Introduction to the special issue on deep reinforcement learning: An editorial' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/IEEEares/OvensM16> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/journals/nn/SunSTH18> dblp:publishedIn ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "ARES"
            },
            {
                "answer": "Neural Networks"
            }
        ]
    },
    {
        "question": "From where are most of the authors of 'Photogrammetric mapping and measuring application using MATLAB' from?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/gandc/MadeiraGB10> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "University of Porto, Portugal",
                "count": "1"
            }
        ]
    },
    {
        "question": "In 'J. Medical Syst.', how many papers has the author 'George Vassilacopoulos' published?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/81/2973> . ?answer dblp:publishedIn 'J. Medical Syst.' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "1"
            }
        ]
    },
    {
        "question": "Was the publication 'Software Engineering User Study Recruitment on Prolific: An Experience Report' published in the year '2022'?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-2201-05348> dblp:yearOfPublication '2022' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "In what venue was 'Using x-gram for efficient speech recognition' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/interspeech/BonafonteM98> dblp:publishedIn ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "ICSLP"
            }
        ]
    },
    {
        "question": "In which year did 'Vikas Chowdhry' publish the least papers and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/19/4150> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2002",
                "count": "1"
            }
        ]
    },
    {
        "question": "In what venue was 'Fundamentals of simple games from a viewpoint of blockability relations' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/amc/Ishikawa09> dblp:publishedIn ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "Appl. Math. Comput."
            }
        ]
    },
    {
        "question": "Was the paper 'An improved algorithm for calculating fuzzy attribute reducts' not not published by 'Meng-Yao Zhai'?",
        "query": "ASK { <https://dblp.org/rec/journals/jifs/ZhaiZB13> dblp:authoredBy <https://dblp.org/pid/73/10112> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Haven't the authors of the publication 'A SPICE-Based Library for Mechatronic Systems' published the paper 'Benchmarking Commercial Intent Detection Services with Practice-Driven Evaluations'?",
        "query": "ASK { <https://dblp.org/rec/conf/iscas/ScholliersY95> dblp:authoredBy ?x . <https://dblp.org/rec/conf/naacl/QiPSSKYP21> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/naacl/QiPSSKYP21> != <https://dblp.org/rec/conf/iscas/ScholliersY95>) FILTER NOT EXISTS { <https://dblp.org/rec/conf/iscas/ScholliersY95> dblp:authoredBy ?x . <https://dblp.org/rec/conf/naacl/QiPSSKYP21> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/naacl/QiPSSKYP21> != <https://dblp.org/rec/conf/iscas/ScholliersY95>) } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many papers did the authors of 'The circle as a smoothly joined BR-curve on [0, 1]' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/cagd/FiorotJC97> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "15"
            }
        ]
    },
    {
        "question": "Has the paper 'On the Power of Discrete and of Lexicographic Helly-Type Theorems' not not been published by 'Nir Halman'?",
        "query": "ASK { <https://dblp.org/rec/conf/focs/Halman04> dblp:authoredBy <https://dblp.org/pid/58/5627> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Where were the publications 'Mobile multicast support in IP networks' and 'A Psychologically Informed Approach to CLPsych Shared Task 2018' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/globecom/Lin02> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/acl-clpsych/SimchonG18> dblp:publishedIn ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "GLOBECOM"
            },
            {
                "answer": "CLPsych@NAACL-HTL"
            }
        ]
    },
    {
        "question": "What are the venues in which the author 'Klaus Mathiak' published?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/97/2715> . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "ICPM"
            },
            {
                "answer": "MIE"
            },
            {
                "answer": "CIVR"
            },
            {
                "answer": "Int. J. Medical Informatics"
            },
            {
                "answer": "Fun and Games"
            },
            {
                "answer": "Biomed. Signal Process. Control."
            },
            {
                "answer": "J. Comput. Mediat. Commun."
            },
            {
                "answer": "LOG IN"
            },
            {
                "answer": "J. Cogn. Neurosci."
            },
            {
                "answer": "Sensors"
            },
            {
                "answer": "IEEE Trans. Biomed. Eng."
            },
            {
                "answer": "NeuroImage"
            },
            {
                "answer": "Int. J. Neural Syst."
            }
        ]
    },
    {
        "question": "From where are most of the authors of 'Fast load balancing via bounded best response' from?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/soda/AwerbuchAK08> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Tel Aviv University, Israel, Johns Hopkins University, USA",
                "count": "1"
            }
        ]
    },
    {
        "question": "What is the type of '\\u00DCber nicht lernbare Probleme oder Ein Modell f\\u00FCr die vorzeitige S\\u00E4ttigung bei vorw\\u00E4rtsgekoppelten Neuronalen Netzen'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/dagm/Goerick95> dblp:bibtexType ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://purl.org/net/nknouf/ns/bibtex#Inproceedings"
            }
        ]
    },
    {
        "question": "Does the publication 'Joint Channel Estimation and Channel Decoding in Physical-Layer Network Coding Systems: An EM-BP Factor Graph Framework' exist?",
        "query": "ASK { <https://dblp.org/rec/journals/twc/WangL14> dblp:title 'Joint Channel Estimation and Channel Decoding in Physical-Layer Network Coding Systems: An EM-BP Factor Graph Framework' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the papers that 'Liuyang Yuan' and 'Mujiao Fan' published in 'J. Appl. Math.'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/53/10589> . ?answer dblp:publishedIn 'J. Appl. Math.' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/89/10082> . ?answer dblp:publishedIn 'J. Appl. Math.' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/jam/WanCSY11"
            },
            {
                "answer": "https://dblp.org/rec/journals/jam/YuanT14"
            }
        ]
    },
    {
        "question": "When were the papers 'Robust Real-Time Human Activity Recognition from Tracked Face Displacements' and 'Automated Machine Learning: Prospects and Challenges' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/epia/RybskiV05> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/iccsa/VaccaroSM20> dblp:yearOfPublication ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "2005"
            },
            {
                "answer": "2020"
            }
        ]
    },
    {
        "question": "In which year did 'Hsin-Fa Lin' publish the most publications?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/257/6214> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2019",
                "count": "2"
            }
        ]
    },
    {
        "question": "Does 'Bayesian Semi-Supervised Chinese Word Segmentation for Statistical Machine Translation' not not exist?",
        "query": "ASK { <https://dblp.org/rec/conf/coling/XuGTN08> dblp:title 'Bayesian Semi-Supervised Chinese Word Segmentation for Statistical Machine Translation' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where are the authors of the paper 'Optimal Multicast Loop Algorithm for Multimedia Traffic Distribution' from?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/euc/LeeA05> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "University of Oklahoma, Norman, USA"
            }
        ]
    },
    {
        "question": "Was 'Poster abstract: NMEMD: A novel method for efficiently measuring software-defined network delay' not published in '2018'?",
        "query": "ASK { <https://dblp.org/rec/conf/infocom/ZhangZS18> dblp:yearOfPublication '2018' FILTER NOT EXISTS { <https://dblp.org/rec/conf/infocom/ZhangZS18> dblp:yearOfPublication '2018' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where are the majority of the authors of the paper 'Beamtrees: compact visualization of large hierarchies' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/ivs/HamW03> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "IBM Research, Eindhoven University of Technology, the Netherlands",
                "count": "1"
            }
        ]
    },
    {
        "question": "Who is the most frequent co-author of 'Xiaoyang Long'?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/173/3095> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/173/3095>)} GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "https://dblp.org/pid/118/5755",
                "count": "5"
            }
        ]
    },
    {
        "question": "Hasn't 'Rick Rabiser' not published in '2014'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/r/RickRabister> . ?x dblp:yearOfPublication '2014' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    }
]