[
    {
        "question": "Was the publication 'Optimal Buffer Management Strategy for Minimizing Delivery Latency of Streaming Data with Packet Dependencies' published in 'IEICE Trans. Commun.'?",
        "query": "ASK { <https://dblp.org/rec/journals/ieicet/WuNZY16> dblp:publishedIn 'IEICE Trans. Commun.' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "How many venues has 'Weiru Liu' published in?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/l/WeiruLiu> . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "87"
            }
        ]
    },
    {
        "question": "What is the primary affiliation of most of the authors of 'Addressing the uncertain quality and quantity of returns in closed-loop supply chains'?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/cce/ZeballosSBN12> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "Instituto Superior Tecnico, Lisbon, Portugal",
                "count": "1"
            }
        ]
    },
    {
        "question": "Have the authors of the paper 'Symmetry Compression Method for Discovering Network Motifs' not not published the paper 'Detection of Gene Orthology Based on Protein-Protein Interaction Networks'?",
        "query": "ASK { <https://dblp.org/rec/journals/tcbb/WangHWP12> dblp:authoredBy ?x . <https://dblp.org/rec/conf/bibm/TowficGH09> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/bibm/TowficGH09> != <https://dblp.org/rec/journals/tcbb/WangHWP12>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "How many papers has 'Robin Bergenthum' published in 'Petri Nets'?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/60/2514> . ?answer dblp:publishedIn 'Petri Nets' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "5"
            }
        ]
    },
    {
        "question": "How many papers did the authors of the publication 'The Effects of Image Pre- and Post-Processing, Wavelet Decomposition, and Local Binary Patterns on U-Nets for Skin Lesion Segmentation' publish in the year '2018'?",
        "query": "SELECT DISTINCT (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/corr/abs-1805-05239> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2018' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "18"
            }
        ]
    },
    {
        "question": "What are the DOIs of the papers 'Effect of sampling time and sampling instant on the frequency response of a boost converter' and 'Strategy planner: Graphical definition of soccer set-plays'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iecon/AroraBB16> dblp:doi ?answer } UNION { <https://dblp.org/rec/journals/dke/CravoAARLM14> dblp:doi ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "http://dx.doi.org/10.1109/iecon.2016.7793125"
            },
            {
                "answer": "https://doi.org/10.1109/iecon.2016.7793125"
            },
            {
                "answer": "http://dx.doi.org/10.1016/j.datak.2014.10.001"
            },
            {
                "answer": "https://doi.org/10.1016/j.datak.2014.10.001"
            }
        ]
    },
    {
        "question": "Have the authors of the paper '3D DenseNet Ensemble in 4-Way Classification of Alzheimer's Disease' not not published a publication in 'BI'?",
        "query": "ASK { <https://dblp.org/rec/conf/brain/RuizMMK20> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/brain/RuizMMK20>) . ?y dblp:publishedIn 'BI' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "In what year was 'Clarifying Ambiguous Keywords with Personal Word Embeddings for Personalized Search' published?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/journals/tois/YaoDW22> dblp:yearOfPublication ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "2022"
            }
        ]
    },
    {
        "question": "What is the primary affiliation of most of the authors of 'On the use of genetic programming to evolve priority rules for resource constrained project scheduling problems'?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/isci/ChandHSRW18> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "University of Adelaide, Australia, University of New South Wales, Canberra, Australia",
                "count": "1"
            }
        ]
    },
    {
        "question": "Have 'Quanming Liu' and 'Saeed Seraj' not co-authored the paper 'A Comprehensive Empirical Investigation on Failure Clustering in Parallel Debugging'?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-2207-07992> dblp:authoredBy <https://dblp.org/pid/123/3806> . <https://dblp.org/rec/journals/corr/abs-2207-07992> dblp:authoredBy <https://dblp.org/pid/273/2199> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2207-07992> dblp:authoredBy <https://dblp.org/pid/123/3806> . <https://dblp.org/rec/journals/corr/abs-2207-07992> dblp:authoredBy <https://dblp.org/pid/273/2199> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "In which conferences or journals did 'Neha V. Karanjkar' publish papers in the last 4 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/87/9120> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-4) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "MASCOTS"
            },
            {
                "answer": "CoRR"
            },
            {
                "answer": "IEEE Trans. Very Large Scale Integr. Syst."
            }
        ]
    },
    {
        "question": "How many authors does 'Integrating embedded computing systems into high school and early undergraduate education' have?",
        "query": "SELECT ?answer WHERE { <https://dblp.org/rec/conf/mse/BensonAKKG09> dblp:numberOfCreators ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "5"
            }
        ]
    },
    {
        "question": "What other papers were published by the authors of the paper 'Using the keystroke-level model for designing user interface on middle-sized touch screens'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/chi/Abdulin11> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER (?answer != <https://dblp.org/rec/conf/chi/Abdulin11>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/btas/AbdulinK15"
            },
            {
                "answer": "https://dblp.org/rec/conf/chi/AbdulinK15"
            },
            {
                "answer": "https://dblp.org/rec/conf/chi/AbdulinRK16"
            },
            {
                "answer": "https://dblp.org/rec/conf/chi/AbdulinB16"
            },
            {
                "answer": "https://dblp.org/rec/conf/chi/AbdulinK17"
            },
            {
                "answer": "https://dblp.org/rec/conf/etra/LohrAK16"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-1904-07361"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-2009-06171"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-1709-02700"
            },
            {
                "answer": "https://dblp.org/rec/journals/inffus/RigasAK16"
            }
        ]
    },
    {
        "question": "What is the type of the publication 'Action-02MCF: A Robust Space-Time Correlation Filter for Action Recognition in Clutter and Adverse Lighting Conditions'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/acivs/HaqYZG16> dblp:bibtexType ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://purl.org/net/nknouf/ns/bibtex#Inproceedings"
            }
        ]
    },
    {
        "question": "In which year did the author 'Markus Werning' publish the most papers?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/00/7006> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2015, 2014",
                "count": "3"
            }
        ]
    },
    {
        "question": "Has the author 'Sergey Goncharov' not not published in '1986'?Didn't 'Sergey Goncharov' not publish in '1986'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/g/SergeyGoncharov2> . ?x dblp:yearOfPublication '1986' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Did the authors of 'All-pay 2\\u00D72 Hex: a multibattle contest with complementarities' not not publish 'Ein Firmware-Interpreter f\\u00FCr blockorientierte Programmiersprachen'?",
        "query": "ASK { <https://dblp.org/rec/journals/ijgt/KovenockSW15> dblp:authoredBy ?x . <https://dblp.org/rec/conf/gacm/Kroneberg80> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/gacm/Kroneberg80> != <https://dblp.org/rec/journals/ijgt/KovenockSW15>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "'Dora' published papers about 'motor cortex' in which venues?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Dora', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?t . FILTER REGEX (?t, 'motor cortex', 'i') . ?z dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "BCI"
            },
            {
                "answer": "J. Cogn. Neurosci."
            },
            {
                "answer": "NeuroImage"
            }
        ]
    },
    {
        "question": "What are all the papers that the authors 'Asadallah Ganjali' and 'L. Villafuerte' published in 'Int. J. Intell. Comput. Cybern.'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/199/6088> . ?answer dblp:publishedIn 'Int. J. Intell. Comput. Cybern.' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/06/4879> . ?answer dblp:publishedIn 'Int. J. Intell. Comput. Cybern.' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/ijicc/EsmaeilzadehAGH16"
            }
        ]
    },
    {
        "question": "Which papers did the author 'A. Colker' publish in the last 1 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/08/6066> . ?answer dblp:yearOfPublication ?y FILTER(?y > YEAR(NOW())-1) }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/journals/cacm/Colker63"
            },
            {
                "answer": "https://dblp.org/rec/journals/cacm/Colker63a"
            }
        ]
    },
    {
        "question": "Where were the publications 'Bautin bifurcation' and 'From Reaction to Cognition: 5th European Workshop on Modelling an Agent in a Multi-Agent World - MAAMAW'93' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/scholarpedia/GuckenheimerK07b> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/maamaw/CastelfranchiM93> dblp:publishedIn ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "Scholarpedia"
            },
            {
                "answer": "MAAMAW"
            }
        ]
    },
    {
        "question": "Doesn't the paper 'A Logging Overhead Optimization Method Based on Anomaly Detection Model' not exist?",
        "query": "ASK { <https://dblp.org/rec/conf/hucc/WangZ20> dblp:title 'A Logging Overhead Optimization Method Based on Anomaly Detection Model' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "'Piero' published papers about 'bridge domain' in which venues?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Piero', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?t . FILTER REGEX (?t, 'bridge domain', 'i') . ?z dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "MoDELS (Workshops)"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'Application of Correlation-Based Regression Analysis for Improvement of Power Distribution Network' also publish a paper in '2008'?",
        "query": "ASK { <https://dblp.org/rec/journals/ieicet/HagiwaraUSM08> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/journals/ieicet/HagiwaraUSM08>) . ?y dblp:yearOfPublication '2008' }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "In which venues did 'D. Qian' publish papers in the last 7 years?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/133/1591> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-7) . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "IET Commun."
            }
        ]
    },
    {
        "question": "Did 'Wen Gao' publish the paper 'Curse of Mis-alignment in Face Recognition: Problem and a Novel Mis-alignment Learning Solution' in 'FGR' in the last 1 years?",
        "query": "ASK { <https://dblp.org/rec/conf/fgr/ShanCGCY04> dblp:authoredBy <https://dblp.org/pid/g/WenGao> . <https://dblp.org/rec/conf/fgr/ShanCGCY04> dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-1) . <https://dblp.org/rec/conf/fgr/ShanCGCY04> dblp:publishedIn 'FGR' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    }
]