[
    {
        "question": "What are the papers that the authors 'Bertram Poettering' and 'Jae S. Lim' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/48/8243> } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/66/698> } }",
        "entity": "CREATOR",
        "query_type": "UNION"
    },
    {
        "question": "Who are the authors that published research papers about entity linking in 'Int. J. Inf. Syst. Supply Chain Manag.' in the year '2018'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:title ?t . FILTER CONTAINS (LCASE(?t), entity linking) . ?x dblp:publishedIn 'Int. J. Inf. Syst. Supply Chain Manag.' . FILTER CONTAINS(LCASE('Int. J. Inf. Syst. Supply Chain Manag.'), 'Int. J. Inf. Syst. Supply Chain Manag.') . ?x dblp:year ?y . FILTER(?y = '2018') . ?x dblp:authoredBy ?answer }",
        "entity": "PUBLICATION",
        "query_type": "DISAMBIGUATION"
    },
    {
        "question": "What is the website of the author 'Tiansheng Wang'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/141/1846> dblp:website ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT"
    },
    {
        "question": "What is the average number of co-authors for research papers published by the author 'Robin Cohen'?",
        "query": "SELECT (AVG(?count) AS ?answer) { SELECT (COUNT(?y) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/24/441> . ?x dblp:numberOfCreators ?y )} GROUP BY ?y }",
        "entity": "CREATOR",
        "query_type": "COUNT"
    },
    {
        "question": "Does 'Ray J. Paul' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/p/RayJPaul> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN"
    },
    {
        "question": "Did 'Robert W. Brodersen' publish the paper 'Impact of scattering on the capacity, diversity, and propagation range of multiple-antenna channels' in 'IEEE Trans. Inf. Theory' in the last 8 years?",
        "query": "ASK { <https://dblp.org/rec/journals/tit/PoonTB06> dblp:authoredBy <https://dblp.org/pid/53/3917> . <https://dblp.org/rec/journals/tit/PoonTB06> dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-8) . <https://dblp.org/rec/journals/tit/PoonTB06> dblp:publishedIn 'IEEE Trans. Inf. Theory' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN"
    },
    {
        "question": "How many authors does the publication 'Why Bundle Discounts Can Be a Profitable Alternative to Competing on Price Promotions' have?",
        "query": "SELECT ?answer WHERE { <https://dblp.org/rec/journals/mktsci/BalachanderGS10> dblp:numberOfCreators ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT"
    },
    {
        "question": "Did the author 'Ilker Hacihaliloglu' not publish in 'ISBI' in the last 8 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/81/5273> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-8) . ?x dblp:publishedIn 'ISBI' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/81/5273> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-8) . ?x dblp:publishedIn 'ISBI' }",
        "entity": "CREATOR",
        "query_type": "NEGATION"
    },
    {
        "question": "Wasn't 'CATI: An Extensible Platform Supporting Assisted Classification of Large Datasets' published in the year '2020'?",
        "query": "ASK { <https://dblp.org/rec/conf/webist/BosettiE19> dblp:yearOfPublication '2020' FILTER NOT EXISTS { <https://dblp.org/rec/conf/webist/BosettiE19> dblp:yearOfPublication '2020' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION"
    },
    {
        "question": "How many publications has 'Norbert Fuhr' published?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/f/NFuhr> }",
        "entity": "CREATOR",
        "query_type": "COUNT"
    },
    {
        "question": "In which venues did 'Ronaldo publish publications about entity linking?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Ronaldo, 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?t . FILTER REGEX (?t, entity linking, 'i') . ?z dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION"
    },
    {
        "question": "What are the papers that 'Jingrou Wu' and 'Junping Zhang' published in 'IEEE Internet Things J.'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/301/2856> . ?answer dblp:publishedIn 'IEEE Internet Things J.' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/02/5388> . ?answer dblp:publishedIn 'IEEE Internet Things J.' } }",
        "entity": "CREATOR",
        "query_type": "UNION"
    },
    {
        "question": "Does the paper 'Community networks: Community capital or merely an affordable Internet access tool?' not exist?",
        "query": "ASK { <https://dblp.org/rec/journals/jasis/Kwon05> dblp:title 'Community networks: Community capital or merely an affordable Internet access tool?' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jasis/Kwon05> dblp:title 'Community networks: Community capital or merely an affordable Internet access tool?' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION"
    },
    {
        "question": "Was the paper 'Ontology-Based User Preferences and Social Search for Spoken Dialogue Systems' not published by the person 'Nesrine Ben Mustapha'?",
        "query": "ASK { <https://dblp.org/rec/conf/smap/VanrompayMA12> dblp:authoredBy <https://dblp.org/pid/59/3607> FILTER NOT EXISTS { <https://dblp.org/rec/conf/smap/VanrompayMA12> dblp:authoredBy <https://dblp.org/pid/59/3607> }",
        "entity": "CREATOR",
        "query_type": "NEGATION"
    },
    {
        "question": "Did the authors of 'Preface' not not publish 'Transition Systems of Elementary Net Systems with Localities'?",
        "query": "ASK { <https://dblp.org/rec/journals/jcst/ZhouL10> dblp:authoredBy ?x . <https://dblp.org/rec/conf/concur/KoutnyP06> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/concur/KoutnyP06> != <https://dblp.org/rec/journals/jcst/ZhouL10>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION"
    },
    {
        "question": "In which year did the author 'Lunzhi Deng' publish the least publications?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/131/1122> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK"
    },
    {
        "question": "How many venues has the author 'Paolo Terenziani' published in?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/26/279> . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "COUNT"
    },
    {
        "question": "Where are the majority of the authors of 'Anonymisierte Daten brauchen keinen Datenschutz - wirklich nicht?' affiliated to?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/books/sp/22/Kneuper22> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK"
    },
    {
        "question": "'Piotr Kulczycki' published the most papers in which venue and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/74/4974> . ?x dblp:publishedIn ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK"
    },
    {
        "question": "Who are the co-authors of 'Der-Chyuan Lou' and where are they affiliated?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/06/1542> . ?x dblp:authoredBy ?firstanswer FILTER(?firstanswer != <https://dblp.org/pid/06/1542>) . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT"
    },
    {
        "question": "What are the papers that 'Christopher J. Carpenter' and 'Tatsuhide Matsuda' published in 'Int. J. Interact. Commun. Syst. Technol.'?",
        "query": "SELECT DISTINCT ?answer WHERE { { ?answer dblp:authoredBy <https://dblp.org/pid/28/1533> . ?answer dblp:publishedIn 'Int. J. Interact. Commun. Syst. Technol.' } UNION { ?answer dblp:authoredBy <https://dblp.org/pid/132/4568> . ?answer dblp:publishedIn 'Int. J. Interact. Commun. Syst. Technol.' } }",
        "entity": "CREATOR",
        "query_type": "UNION"
    },
    {
        "question": "From where are most of the authors of 'A Balanced Phase Shifter With Common-Mode Suppression' from?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/journals/tie/ZhangS19> dblp:authoredBy ?x . ?x dblp:primaryAffiliation ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "PUBLICATION",
        "query_type": "RANK"
    },
    {
        "question": "What are the title of the papers that 'Song wrote about entity linking published in 'IEEE Internet Things J.'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Song, 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?answer . FILTER REGEX (?answer, entity linking, 'i') . ?z dblp:publishedIn 'IEEE Internet Things J.' }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION"
    },
    {
        "question": "In 'SIGACT News', how many publications has 'Rocky Ross' published?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/24/6282> . ?answer dblp:publishedIn 'SIGACT News' }",
        "entity": "CREATOR",
        "query_type": "COUNT"
    },
    {
        "question": "Did the authors of 'Controllability of semilinear stochastic integrodifferential systems' also publish 'Feedback-based error control for mobile video transmission'?",
        "query": "ASK { <https://dblp.org/rec/journals/kybernetika/BalachandranKK07> dblp:authoredBy ?x . <https://dblp.org/rec/journals/pieee/GirodF99> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/pieee/GirodF99> != <https://dblp.org/rec/journals/kybernetika/BalachandranKK07>) }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN"
    },
    {
        "question": "Who are the authors that published papers about entity linking in 'ICPR' in '2018'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:title ?t . FILTER CONTAINS (LCASE(?t), entity linking) . ?x dblp:publishedIn 'ICPR' . FILTER CONTAINS(LCASE('ICPR'), 'ICPR') . ?x dblp:year ?y . FILTER(?y = '2018') . ?x dblp:authoredBy ?answer }",
        "entity": "PUBLICATION",
        "query_type": "DISAMBIGUATION"
    },
    {
        "question": "Who are the authors of the paper 'Determining and improving the fault tolerance of multilayer perceptrons in a pattern-recognition application' and where are they from?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/tnn/EmmersonD93> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT"
    },
    {
        "question": "Wasn't the paper 'Systems Analysis and Design: An Essential Part of IS Education' published in the year '2006'?",
        "query": "ASK { <https://dblp.org/rec/journals/jisedu/HarrisLOS06> dblp:yearOfPublication '2006' FILTER NOT EXISTS { <https://dblp.org/rec/journals/jisedu/HarrisLOS06> dblp:yearOfPublication '2006' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION"
    },
    {
        "question": "Who are the authors of the publication 'Abnormality detection in crowd videos by tracking sparse components' and what other papers did they publish?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/journals/mva/BiswasG17> dblp:authoredBy ?firstanswer . ?secondanswer dblp:authoredBy ?firstanswer FILTER (?secondanswer != <https://dblp.org/rec/journals/mva/BiswasG17>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT"
    },
    {
        "question": "What is the ORCID of 'Jenq Kuen Lee'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/42/3701> dblp:orcid ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT"
    },
    {
        "question": "Did 'Ignacio Aedo' not not publish in '2016'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/a/IgnacioAedo> . ?x dblp:yearOfPublication '2016' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION"
    },
    {
        "question": "Who are the authors of the publication 'Application of ANN Based Pattern Recognition Technique for the Protection of 3-Phase Power Transformer' and where are they from?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/semcco/BalagaVS11> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT"
    },
    {
        "question": "'Efthimios Bothos' published the most publications in which venue?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/57/5887> . ?x dblp:publishedIn ?answer } GROUP BY ?answer } ORDER BY DESC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK"
    },
    {
        "question": "Did 'Himanshu Neema' not publish the paper 'Modeling and Optimization of a Longitudinally-Distributed Global Solar Grid'?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-2206-05584> dblp:authoredBy <https://dblp.org/pid/50/3859> FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-2206-05584> dblp:authoredBy <https://dblp.org/pid/50/3859> }",
        "entity": "CREATOR",
        "query_type": "NEGATION"
    },
    {
        "question": "In which venues did 'Suguru Arimoto' publish papers and what are the titles of these papers?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/a/SuguruArimoto> . ?x dblp:publishedIn ?firstanswer . ?x dblp:title ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT"
    },
    {
        "question": "In the year '2011' in 'DaWaK', what are the titles of the research papers on entity linking?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:title ?answer . FILTER CONTAINS (LCASE(?answer), entity linking) . ?x dblp:publishedIn 'DaWaK' . FILTER CONTAINS(LCASE('DaWaK'), 'DaWaK') . ?x dblp:year ?y . FILTER(?y = '2011') }",
        "entity": "PUBLICATION",
        "query_type": "DISAMBIGUATION"
    },
    {
        "question": "Which other papers were published by the authors of the paper 'Hitting Three Birds with One System: A Voice-Based CAPTCHA for the Modern User'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/icws/ShahH18> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x FILTER (?answer != <https://dblp.org/rec/conf/icws/ShahH18>) }",
        "entity": "PUBLICATION",
        "query_type": "MULTI_FACT"
    },
    {
        "question": "What is the primary affiliation of the author named 'Jayabrabu Ramakrishnan'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/pid/250/2242> dblp:primaryAffiliation ?answer }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT"
    }
]