[
    {
        "question": "What are the publications written by the author 'Shinichi Takagi'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/89/3434> }",
        "entity": "CREATOR",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/cicc/Takagi09"
            },
            {
                "answer": "https://dblp.org/rec/conf/icmcs/TakagiHYKT03"
            },
            {
                "answer": "https://dblp.org/rec/conf/vlsic/MatsuiTTT21"
            },
            {
                "answer": "https://dblp.org/rec/conf/vlsic/SekineTTT21"
            },
            {
                "answer": "https://dblp.org/rec/conf/vcip/TakagiHYKT03"
            },
            {
                "answer": "https://dblp.org/rec/conf/ps/TakenakaHLHLOT18"
            },
            {
                "answer": "https://dblp.org/rec/conf/irps/LeeTTT21"
            },
            {
                "answer": "https://dblp.org/rec/conf/mixdes/TakagiKSJLTATTT19"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/LiHTT19"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/TangOMTTT21"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/ZhaoHLTTT30"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/KangYTT16"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/KimFTTT15"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/KimTOHT14"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/LiHFNTTTT30"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/LiHHTT18"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/OhnoMBTTT21"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/ParkTT17"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/TakenakaHPBFTT18"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/HanTT17"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/IkkuYIOHTT14"
            },
            {
                "answer": "https://dblp.org/rec/conf/ofc/OhnoLSFNTTTT30"
            },
            {
                "answer": "https://dblp.org/rec/conf/essderc/KeTT17"
            },
            {
                "answer": "https://dblp.org/rec/conf/essderc/KimYINIOHTT13"
            },
            {
                "answer": "https://dblp.org/rec/conf/essderc/TakagiKJMTAGT18"
            },
            {
                "answer": "https://dblp.org/rec/conf/essderc/TakagiT15"
            },
            {
                "answer": "https://dblp.org/rec/conf/essderc/WadaSZT12"
            },
            {
                "answer": "https://dblp.org/rec/conf/3dic/SumitaTKTTT19"
            },
            {
                "answer": "https://dblp.org/rec/conf/icicdt/TakagiAGNNKYCYY17"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/FujigakiTT18"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/MiyatakeHPSMTMN20"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/OhnoLSTMBTTT20"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/OhnoTTT20"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/TakenakaHBPLHLO18"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/ZhaoHLTTT21"
            },
            {
                "answer": "https://dblp.org/rec/conf/ecoc/KimFTTT14"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-2106-01872"
            },
            {
                "answer": "https://dblp.org/rec/journals/jcphy/TakagiFWX22"
            },
            {
                "answer": "https://dblp.org/rec/journals/corr/abs-2106-04351"
            },
            {
                "answer": "https://dblp.org/rec/journals/ieiceee/TanamotoTT20"
            },
            {
                "answer": "https://dblp.org/rec/journals/ieiceee/ChengITT14"
            },
            {
                "answer": "https://dblp.org/rec/journals/vlsi/Takagi98"
            }
        ]
    },
    {
        "question": "Was the paper 'A 342-Approximation Algorithm for Scheduling Malleable Tasks under Precedence Constraints' not not published in the year '2013'?",
        "query": "ASK { <https://dblp.org/rec/journals/tpds/ChenC13> dblp:yearOfPublication '2013' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Which venues has 'Guanghao Sun' published in?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/44/10581> . ?x dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "MULTI_FACT",
        "answers": [
            {
                "answer": "NER"
            },
            {
                "answer": "SAS"
            },
            {
                "answer": "FGIT-DTA/BSBT"
            },
            {
                "answer": "BIC-TA"
            },
            {
                "answer": "EMBC"
            },
            {
                "answer": "GCCE"
            },
            {
                "answer": "Biomed. Signal Process. Control."
            },
            {
                "answer": "J. Sensors"
            },
            {
                "answer": "Int. J. E Health Medical Commun."
            },
            {
                "answer": "SSCI"
            },
            {
                "answer": "Sensors"
            },
            {
                "answer": "IEEE Trans. Biomed. Eng."
            },
            {
                "answer": "J. Medical Syst."
            },
            {
                "answer": "Neural Comput."
            },
            {
                "answer": "Comput. Intell. Neurosci."
            },
            {
                "answer": "IEEE Access"
            }
        ]
    },
    {
        "question": "Did 'Karat Thanaboonkong' publish in 'ROBIO' in the last 4 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/161/8446> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-4) . ?x dblp:publishedIn 'ROBIO' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "In which year did the author 'Yingying Chi' publish the least research papers?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/253/6811> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2019, 2022",
                "count": "1"
            }
        ]
    },
    {
        "question": "Was the paper 'Nonlinear principal component analysis of noisy data' co-authored by 'William W. Hsieh' and 'Philippe Pitteloud'?",
        "query": "ASK { <https://dblp.org/rec/conf/ijcnn/Hsieh06> dblp:authoredBy <https://dblp.org/pid/63/2321> . <https://dblp.org/rec/conf/ijcnn/Hsieh06> dblp:authoredBy <https://dblp.org/pid/37/5329> }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Wasn't the paper 'The minimum discrepancy measure: its use in univariate white noise tests' not not published by the person named 'Rong-Ming Chen'?",
        "query": "ASK { <https://dblp.org/rec/journals/tsp/ChenC93> dblp:authoredBy <https://dblp.org/pid/52/4941> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Was the paper 'An Asymptotic Performance/Energy Analysis and Optimization of Multi-core Architectures' published by 'Wook Shin'?",
        "query": "ASK { <https://dblp.org/rec/conf/icdcn/LeeJS09> dblp:authoredBy <https://dblp.org/pid/43/2144> }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "How many publications did the authors of 'Vector Gaussian Heegard-Berger Problem With Common Reconstructions' publish?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/wcsp/LuX21> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "190"
            }
        ]
    },
    {
        "question": "Did the author 'Alexander Sherikov' not publish in 'Geometric and Numerical Foundations of Movements'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/09/10336> . ?x dblp:publishedIn 'Geometric and Numerical Foundations of Movements' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/09/10336> . ?x dblp:publishedIn 'Geometric and Numerical Foundations of Movements' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "What are the papers published by 'Maciej Nowak' and in which year?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/95/6997> . ?firstanswer dblp:yearOfPublication ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/rec/conf/kicss/Nowak13",
                "secondanswer": "2016"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/tal/DutkiewiczFNJ14",
                "secondanswer": "2014"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/iccS/NowakWS21",
                "secondanswer": "2021"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/missi/JedrzejekNF12",
                "secondanswer": "2013"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/mcis/OFlahertyONPSAP17",
                "secondanswer": "2017"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/softcom/NowakWS21",
                "secondanswer": "2021"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/or/NowakT15",
                "secondanswer": "2017"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/jurix/JedrzejekBFCN11",
                "secondanswer": "2011"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/esws/BakNJ14",
                "secondanswer": "2014"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/ruleml/BakNJ13",
                "secondanswer": "2013"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/ruleml/DutkiewiczNJ14",
                "secondanswer": "2014"
            },
            {
                "firstanswer": "https://dblp.org/rec/conf/ruleml/NowakBJ12",
                "secondanswer": "2012"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/jgo/NowakT13",
                "secondanswer": "2013"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/anor/NowakT22",
                "secondanswer": "2022"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/eor/Nowak04",
                "secondanswer": "2004"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/eor/Nowak06",
                "secondanswer": "2006"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/eor/Nowak07",
                "secondanswer": "2007"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/entropy/NowakTS21",
                "secondanswer": "2021"
            },
            {
                "firstanswer": "https://dblp.org/rec/journals/cejor/TargielNT18",
                "secondanswer": "2018"
            }
        ]
    },
    {
        "question": "With how many other authors has 'Burton S. Kaliski Jr.' co-authored papers?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/12/5585> . ?x dblp:authoredBy ?answer FILTER(?answer != <https://dblp.org/pid/12/5585>) }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "60"
            }
        ]
    },
    {
        "question": "Was a paper not not co-authored by 'S\\u00F3stenes Lins' and 'David Veal'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/86/4496> . ?x dblp:authoredBy <https://dblp.org/pid/51/6236> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the authors 'Yuming Mao' and 'Fabio Checconi' not not co-author a paper?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/02/463> . ?x dblp:authoredBy <https://dblp.org/pid/30/6992> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Where were the publications 'Multi-organ Segmentation via Co-training Weight-Averaged Models from Few-Organ Datasets' and 'Design and Implementation of a MPlambdaS Simulator' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/miccai/HuangZHZL20> dblp:publishedIn ?answer } UNION { <https://dblp.org/rec/conf/pdpta/LeeSYY02> dblp:publishedIn ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "MICCAI (4)"
            },
            {
                "answer": "PDPTA"
            }
        ]
    },
    {
        "question": "Did the authors 'Muhammad Zeeshan Asghar' and 'Dejan S. Milojicic' not not co-author a paper?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/120/7720> . ?x dblp:authoredBy <https://dblp.org/pid/53/726> }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "When were the papers 'Leverage Website Favicon to Detect Phishing Websites' and 'Using Software-Defined Networking for Ransomware Mitigation: the Case of CryptoWall' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/scn/ChiewFSY18> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/journals/corr/CabajM16> dblp:yearOfPublication ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "2018"
            },
            {
                "answer": "2016"
            }
        ]
    },
    {
        "question": "Has 'Laurent Philippe' not not published in '2012'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/p/LaurentPhilippe> . ?x dblp:yearOfPublication '2012' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "How many papers has 'Wolf-Dietrich Ihlenfeldt' published in '1994'?",
        "query": "SELECT (COUNT(DISTINCT ?answer) AS ?count) WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/11/5605> . ?answer dblp:publishedIn '1994' }",
        "entity": "CREATOR",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "0"
            }
        ]
    },
    {
        "question": "Didn't the authors of 'Dynamic simulation and analysis for bolt and nut mating of dual arm robot' publish a publication in 'ROBIO'?",
        "query": "ASK { <https://dblp.org/rec/conf/robio/ZhangHFG12> dblp:authoredBy ?x . ?y dblp:authoredBy ?x FILTER (?y != <https://dblp.org/rec/conf/robio/ZhangHFG12>) . ?y dblp:publishedIn 'ROBIO' FILTER NOT EXISTS { <https://dblp.org/rec/conf/robio/ZhangHFG12> dblp:publishedIn 'ROBIO' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Does 'Wangtao Xiang' have an ORCID?",
        "query": "ASK { <https://dblp.org/pid/290/6791> dblp:orcid ?x }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did the author 'Santosh Kumar' publish in 'ICNS' in the last 1 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/07/2616> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-1) . ?x dblp:publishedIn 'ICNS' }",
        "entity": "CREATOR",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Who are the authors of the paper 'Interaction Force, Impedance and Trajectory Adaptation: By Humans, for Robots' and the publication 'Performance Benchmarking of TOA-Based UWB Indoor Geolocation Systems Using MSE Profiling'?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/conf/iser/BurdetGYA10> dblp:authoredBy ?answer } UNION { <https://dblp.org/rec/conf/iser/BurdetGYA10> dblp:authoredBy ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/pid/95/6492"
            },
            {
                "answer": "https://dblp.org/pid/56/6561"
            },
            {
                "answer": "https://dblp.org/pid/31/778"
            },
            {
                "answer": "https://dblp.org/pid/96/928"
            }
        ]
    },
    {
        "question": "Does the publication 'A low complexity algorithm for detecting rotational symmetry based on the Hough transform technique' have a DOI?",
        "query": "ASK { <https://dblp.org/rec/conf/icpr/PeiH96a> dblp:doi ?y }",
        "entity": "PUBLICATION",
        "query_type": "BOOLEAN",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "What is the type of the publication 'Design of an efficient variable-length FFT processor'?",
        "query": "SELECT DISTINCT ?answer WHERE { <https://dblp.org/rec/conf/iscas/HungCC04> dblp:bibtexType ?answer }",
        "entity": "PUBLICATION",
        "query_type": "SINGLE_FACT",
        "answers": [
            {
                "answer": "http://purl.org/net/nknouf/ns/bibtex#Inproceedings"
            }
        ]
    },
    {
        "question": "Did the author 'Vanessa Paz Dennen' not publish in 'Int. J. Web Based Communities'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/80/6302> . ?x dblp:publishedIn 'Int. J. Web Based Communities' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/80/6302> . ?x dblp:publishedIn 'Int. J. Web Based Communities' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was the paper 'Randomized view planning and occlusion removal for mosaicing building facades' not co-authored by 'Thommen Korah' and 'Sebastian Fischmeister'?",
        "query": "ASK { <https://dblp.org/rec/conf/iros/RasmussenKU05> dblp:authoredBy <https://dblp.org/pid/89/1684> . <https://dblp.org/rec/conf/iros/RasmussenKU05> dblp:authoredBy <https://dblp.org/pid/59/4811> FILTER NOT EXISTS { <https://dblp.org/rec/conf/iros/RasmussenKU05> dblp:authoredBy <https://dblp.org/pid/89/1684> . <https://dblp.org/rec/conf/iros/RasmussenKU05> dblp:authoredBy <https://dblp.org/pid/59/4811> } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Did 'Mahdi Baradarannia' not publish in 'Autom.' in the last 6 years?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/161/1084> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn 'Autom.' FILTER NOT EXISTS { ?x dblp:authoredBy <https://dblp.org/pid/161/1084> . ?x dblp:yearOfPublication ?y . FILTER(?y > YEAR(NOW())-6) . ?x dblp:publishedIn 'Autom.' } }",
        "entity": "CREATOR",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Was not the paper 'Towards improving phenotype representation in OWL' not published in '2012'?",
        "query": "ASK { <https://dblp.org/rec/journals/biomedsem/LoebeSHH12> dblp:yearOfPublication '2012' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "What publications did the author 'Qingyang Zheng' publish in 'ICME' and 'Proc. IEEE'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?answer dblp:authoredBy <https://dblp.org/pid/166/5911> { ?answer dblp:publishedIn 'ICME' } UNION { ?answer dblp:publishedIn 'Proc. IEEE' } }",
        "entity": "CREATOR",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "https://dblp.org/rec/conf/icmcs/WuWLZJCY15"
            }
        ]
    },
    {
        "question": "In which year did 'Haris Aziz' publish the least publications and how many?",
        "query": "SELECT (GROUP_CONCAT(?answer; separator=', ') AS ?answer) ?count WHERE { SELECT DISTINCT ?answer (COUNT(?answer) AS ?count) WHERE { ?x dblp:authoredBy <https://dblp.org/pid/67/2967> . ?x dblp:yearOfPublication ?answer } GROUP BY ?answer } ORDER BY ASC(?count) LIMIT 1",
        "entity": "CREATOR",
        "query_type": "RANK",
        "answers": [
            {
                "answer": "2008",
                "count": "2"
            }
        ]
    },
    {
        "question": "Did 'Ali Mohammadi Shanghooshabad' not not publish in '2022'?",
        "query": "ASK { ?x dblp:authoredBy <https://dblp.org/pid/172/6349> . ?x dblp:yearOfPublication '2022' }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": true
            }
        ]
    },
    {
        "question": "Does 'Class-Specific Object Pose Estimation and Reconstruction Using 3D Part Geometry' not not exist?",
        "query": "ASK { <https://dblp.org/rec/conf/eccv/KumarBBP16> dblp:title 'Class-Specific Object Pose Estimation and Reconstruction Using 3D Part Geometry' }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "Who are the co-authors of the author 'Yuanxiang Wang' and where are they affiliated?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?x dblp:authoredBy <https://dblp.org/pid/151/8846> . ?x dblp:authoredBy ?firstanswer FILTER(?firstanswer != <https://dblp.org/pid/151/8846>) . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/73/2249-8",
                "secondanswer": "State Key Laboratory of Optical Communication Technologies and Networks, Hubei, China"
            },
            {
                "firstanswer": "https://dblp.org/pid/22/2344-1",
                "secondanswer": "Wuhan Research Institute of Posts and Telecommunications, State Key Laboratory of Optical Communication Technologies and Networks, China"
            },
            {
                "firstanswer": "https://dblp.org/pid/80/2732-1",
                "secondanswer": "University of Southern California, Los Angeles, CA, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/99/4812-2",
                "secondanswer": "University of Florida, Gainesville, FL, USA"
            },
            {
                "firstanswer": "https://dblp.org/pid/96/755-6",
                "secondanswer": "Huazhong University of Science and Technology, Wuhan, China"
            },
            {
                "firstanswer": "https://dblp.org/pid/93/1847",
                "secondanswer": "University of Florida, Gainesville, FL, USA"
            }
        ]
    },
    {
        "question": "How many papers did the authors of the paper 'Construction of Safety Confirmation System in the Disaster Countermeasures Headquarters' publish in '2013'?",
        "query": "SELECT DISTINCT (COUNT(?answer) AS ?count) WHERE { <https://dblp.org/rec/conf/3pgcic/IshidaSSUS13> dblp:authoredBy ?x . ?answer dblp:authoredBy ?x . ?answer dblp:yearOfPublication '2013' }",
        "entity": "PUBLICATION",
        "query_type": "COUNT",
        "answers": [
            {
                "count": "41"
            }
        ]
    },
    {
        "question": "Did the authors of the publication 'In-vehicle speaker recognition using independent vector analysis' not publish 'Improved Sufficient Conditions for Global Exponential Stability of Recurrent Neural Networks with Distributed Delays'?",
        "query": "ASK { <https://dblp.org/rec/conf/itsc/YamadaTT12> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijbc/WuCZ08> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/ijbc/WuCZ08> != <https://dblp.org/rec/conf/itsc/YamadaTT12>) FILTER NOT EXISTS { <https://dblp.org/rec/conf/itsc/YamadaTT12> dblp:authoredBy ?x . <https://dblp.org/rec/journals/ijbc/WuCZ08> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/journals/ijbc/WuCZ08> != <https://dblp.org/rec/conf/itsc/YamadaTT12>) } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "In what year was 'On the existence of competitions among information service providers and toll road operators' published and in what venue?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/itsc/Szeto06> dblp:publishedIn ?firstanswer . <https://dblp.org/rec/conf/itsc/Szeto06> dblp:yearOfPublication ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "ITSC",
                "secondanswer": "2006"
            }
        ]
    },
    {
        "question": "Who are the authors of 'Robust Hand Pose Estimation during the Interaction with an Unknown Object' and where are they from?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { <https://dblp.org/rec/conf/iccv/ChoiYCR17> dblp:authoredBy ?firstanswer . ?firstanswer dblp:primaryAffiliation ?secondanswer }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/pid/01/6965",
                "secondanswer": "Purdue University"
            }
        ]
    },
    {
        "question": "Didn't the authors of 'Aspects of the dynamical core of a nonhydrostatic, deep-atmosphere, unified weather and climate-prediction model' not not publish the paper 'Pedestrian detection based on deep convolutional neural network with ensemble inference network'?",
        "query": "ASK { <https://dblp.org/rec/journals/jcphy/StaniforthW08> dblp:authoredBy ?x . <https://dblp.org/rec/conf/ivs/FukuiYYFM15> dblp:authoredBy ?x FILTER (<https://dblp.org/rec/conf/ivs/FukuiYYFM15> != <https://dblp.org/rec/journals/jcphy/StaniforthW08>) }",
        "entity": "PUBLICATION",
        "query_type": "DOUBLE_NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    },
    {
        "question": "When were the publications 'Visualizing and Analyzing Video Content With Interactive Scalable Maps' and 'Multimedia information seeking through search and hyperlinking' published?",
        "query": "SELECT DISTINCT ?answer WHERE { { <https://dblp.org/rec/journals/tmm/MaLZW16> dblp:yearOfPublication ?answer } UNION { <https://dblp.org/rec/conf/mir/EskevichJAOCNGGSNDWGPL13> dblp:yearOfPublication ?answer } }",
        "entity": "PUBLICATION",
        "query_type": "UNION",
        "answers": [
            {
                "answer": "2016"
            },
            {
                "answer": "2013"
            }
        ]
    },
    {
        "question": "In which venues did 'Daniel' publish papers about 'style matching'?",
        "query": "SELECT DISTINCT ?answer WHERE { ?x dblp:primaryFullCreatorName ?y . FILTER REGEX (?y, 'Daniel', 'i') . ?z dblp:authoredBy ?x . ?z dblp:title ?t . FILTER REGEX (?t, 'style matching', 'i') . ?z dblp:publishedIn ?answer }",
        "entity": "CREATOR",
        "query_type": "DISAMBIGUATION",
        "answers": [
            {
                "answer": "IVA"
            },
            {
                "answer": "CoRR"
            }
        ]
    },
    {
        "question": "Which papers did author 'Christopher D. Coltman' publish and in which year?",
        "query": "SELECT DISTINCT ?firstanswer ?secondanswer WHERE { ?firstanswer dblp:authoredBy <https://dblp.org/pid/13/989> . ?firstanswer dblp:yearOfPublication ?secondanswer }",
        "entity": "CREATOR",
        "query_type": "DOUBLE_INTENT",
        "answers": [
            {
                "firstanswer": "https://dblp.org/rec/conf/icip/ColtmanB01",
                "secondanswer": "2001"
            }
        ]
    },
    {
        "question": "Doesn't the publication 'Beating the probabilistic lower bound on perfect hashing' exist?",
        "query": "ASK { <https://dblp.org/rec/journals/corr/abs-1908-08792> dblp:title 'Beating the probabilistic lower bound on perfect hashing' FILTER NOT EXISTS { <https://dblp.org/rec/journals/corr/abs-1908-08792> dblp:title 'Beating the probabilistic lower bound on perfect hashing' } }",
        "entity": "PUBLICATION",
        "query_type": "NEGATION",
        "answers": [
            {
                "boolean": false
            }
        ]
    }
]